obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
/*
ESPTimeCast™

Copyright (c) 2026 M-Factory

This software is source-available for personal, non-commercial use only.
It is not open source.

See LICENSE.txt for full terms.
*/

#include <Arduino.h>
#include <WiFi.h>
#include <AsyncTCP.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <MD_Parola.h>
#include <MD_MAX72xx.h>
#include <SPI.h>
#include <ESPAsyncWebServer.h>
#include <DNSServer.h>
#include <esp_sntp.h>
#include <time.h>
#include <ESPmDNS.h>
#include <Update.h>
#include "version.h"
#include "mfactoryfont.h"
#include "storage/pin_store.h"
#include "tz_lookup.h"      // Timezone lookup, do not duplicate mapping here!
#include "days_lookup.h"    // Languages for the Days of the Week
#include "months_lookup.h"  // Languages for the Months of the Year
#include "index_html.h"     // Web UI
#include "services/sns_utils.h"
#include "network/network_data_coordinator.h"
#include "storage/uptime_store.h"
#include "storage/config_store.h"


// ============================
// LEGACY fallback pins (used ONLY for migration)
// ============================
#if defined(CONFIG_IDF_TARGET_ESP32S2)
#define L_CLK 7
#define L_CS 11
#define L_DATA 12

#elif defined(CONFIG_IDF_TARGET_ESP32S3)
#define L_CLK 18
#define L_CS 16
#define L_DATA 17

#elif defined(CONFIG_IDF_TARGET_ESP32C3)
#define L_CLK 4
#define L_CS 10
#define L_DATA 6

#elif defined(ESP32)
#define L_CLK 18
#define L_CS 23
#define L_DATA 5

#else
#error "Unsupported board!"
#endif

#define HARDWARE_TYPE MD_MAX72XX::FC16_HW
#define MAX_DEVICES 4


int CLK_PIN;
int CS_PIN;
int DATA_PIN;
MD_Parola P = MD_Parola(HARDWARE_TYPE, L_DATA, L_CLK, L_CS, MAX_DEVICES);
AsyncWebServer server(80);
NetworkDataCoordinator networkData;

// --- Global Scroll Speed Settings ---
const int GENERAL_SCROLL_SPEED = 85;  // Default: Adjust this for Weather Description and Countdown Label (e.g., 50 for faster, 200 for slower)
const int RSS_SCROLL_SPEED = 65;      // Faster than general scroll for RSS headlines
int IP_SCROLL_SPEED = 115;            // Default: Adjust this for the IP Address display (slower for readability)
int messageScrollSpeed = 85;          // default fallback

// Order for safe advance display mode
const uint8_t modeOrder[] = {
  0,  // CLOCK
  5,  // DATE
  1,  // WEATHER
  2,  // WEATHER DESCRIPTION
  3,  // COUNTDOWN
  4,  // BRIDGE
  6   // CUSTOM MESSAGE
};

const uint8_t MODE_COUNT = sizeof(modeOrder) / sizeof(modeOrder[0]);
uint8_t modeIndex = 0;

// --- Network data snapshots used by display and status APIs ---
const unsigned int NIGHTSCOUT_IDLE_THRESHOLD_MIN = 10;
int currentGlucose = -1;
String currentDirection = "?";
time_t lastGlucoseTime = 0;
bool nightscoutMmol = false;
long youtubeSubscribers = -1;
long instagramFollowers = -1;
String rssTitle = "";
int BRIDGE_SHOW_EVERY = 3;
int bridgeRotationCount = 0;

// --- Device identity ---
const char *DEFAULT_HOSTNAME = "esptimecast";
const char *DEFAULT_AP_PASSWORD = "12345678";
const char *DEFAULT_AP_SSID = "ESPTimeCast";
String deviceHostname = DEFAULT_HOSTNAME;

// WiFi and configuration globals
char ssid[32] = "";
char password[64] = "";
char openWeatherApiKey[64] = "";
char openWeatherCity[64] = "";
char openWeatherCountry[64] = "";
char weatherUnits[12] = "metric";
char timeZone[64] = "";
char language[8] = "en";
unsigned long lastWifiConnectTime = 0;
String mainDesc = "";
String detailedDesc = "";
bool credentialsExist() {
  return (strlen(ssid) > 0);
}
bool isRebooting = false;

// Timing and display settings
unsigned long clockDuration = 10000;
unsigned long weatherDuration = 5000;
bool displayOff = false;
int brightness = 7;
int lastBrightnessBeforeOff = 7;  // remembers brightness to restore on display_on
bool flipDisplay = false;
bool twelveHourToggle = false;
bool showDayOfWeek = true;
bool showDate = false;
bool showHumidity = false;
bool colonBlinkEnabled = true;
char ntpServer1[64] = "pool.ntp.org";
char ntpServer2[256] = "time.nist.gov";
char customMessage[121] = "";
char lastPersistentMessage[128] = "";
int messageDisplaySeconds;
int messageScrollTimes;
unsigned long messageStartTime = 0;
int currentScrollCount = 0;
int currentDisplayCycleCount = 0;

// Dimming
bool dimmingEnabled = false;
bool displayOffByDimming = false;
bool displayOffByBrightness = false;
int dimStartHour = 18;  // 6pm default
int dimStartMinute = 0;
int dimEndHour = 8;  // 8am default
int dimEndMinute = 0;
int dimBrightness = 2;            // Dimming level (0-15)
bool autoDimmingEnabled = false;  // true if using sunrise/sunset
int sunriseHour = 6;
int sunriseMinute = 0;
int sunsetHour = 18;
int sunsetMinute = 0;
bool clockOnlyDuringDimming = false;
bool configDirty = false;
unsigned long lastBrightnessChange = 0;
const unsigned long saveDelay = 1200;  // 1.2 seconds
int startTotal, endTotal;
bool dimActive = false;

//Countdown Globals
bool countdownEnabled = false;
time_t countdownTargetTimestamp = 0;  // Unix timestamp
char countdownLabel[64] = "";         // Label for the countdown
bool isDramaticCountdown = true;      // Default to the dramatic countdown mode
int countdownSegment = 0;
unsigned long segmentStartTime = 0;

// Runtime uptime persistence timer
unsigned long lastUptimeLog = 0;

struct OtaState {
  bool updating = false;
  bool restartPending = false;
  unsigned long restartRequestedAt = 0;
};
OtaState otaState;

// State management
bool weatherCycleStarted = false;
WiFiClient client;
const byte DNS_PORT = 53;
DNSServer dnsServer;
bool rotationEnabled = true;

String currentTemp = "";
String weatherDescription = "";
String weatherIcon = "";
bool showWeatherDescription = false;
bool weatherAvailable = false;
bool weatherFetched = false;
bool isAPMode = false;
char tempSymbol = '\006';

unsigned long lastSwitch = 0;
unsigned long lastColonBlink = 0;
int displayMode = 0;  // 0: Clock, 1: Weather, 2: Weather Description, 3: Countdown
int prevDisplayMode = -1;
bool clockScrollDone = false;
int currentHumidity = -1;
bool ntpSyncSuccessful = false;

// NTP Synchronization State Machine
enum NtpState {
  NTP_IDLE,
  NTP_SYNCING,
  NTP_SUCCESS,
  NTP_FAILED
};
