obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
// -----------------------------------------------------------------------------
// Network Identity
// -----------------------------------------------------------------------------
void setupHostname() {
#if defined(ESP8266)
  WiFi.hostname(deviceHostname);
#elif defined(ESP32)
  WiFi.setHostname(deviceHostname.c_str());
#endif
}


// -----------------------------------------------------------------------------
// WiFi Setup
// -----------------------------------------------------------------------------
void connectWiFi() {
  Serial.println(F("[WIFI] Connecting to WiFi..."));

  if (!credentialsExist()) {
    Serial.println(F("[WIFI] No saved credentials. Starting AP mode directly."));
    WiFi.mode(WIFI_AP);
    WiFi.disconnect(true);
    delay(100);

    setupHostname();

    if (strlen(DEFAULT_AP_PASSWORD) < 8) {
      WiFi.softAP(DEFAULT_AP_SSID);
      Serial.println(F("[WIFI] AP Mode started (no password, too short)."));
    } else {
      WiFi.softAP(DEFAULT_AP_SSID, DEFAULT_AP_PASSWORD);
      Serial.println(F("[WIFI] AP Mode started."));
    }

    IPAddress apIP(192, 168, 4, 1);
    WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));
    dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
    Serial.print(F("[WIFI] AP IP address: "));
    Serial.println(WiFi.softAPIP());
    isAPMode = true;

    WiFiMode_t mode = WiFi.getMode();
    Serial.printf("[WIFI] WiFi mode after setting AP: %s\n",
                  mode == WIFI_OFF ? "OFF" : mode == WIFI_STA    ? "STA ONLY"
                                           : mode == WIFI_AP     ? "AP ONLY"
                                           : mode == WIFI_AP_STA ? "AP + STA (Error!)"
                                                                 : "UNKNOWN");

    Serial.println(F("[WIFI] AP Mode Started"));
    return;
  }

  // If credentials exist, attempt STA connection
  WiFi.persistent(true);
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(false);
#ifdef ESP8266
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
#endif
#ifdef ESP32
  WiFi.setSleep(false);
#endif
  setupHostname();
  WiFi.disconnect();  // Ensure a clean slate
  delay(100);         // The "Radio Breathing Room"
  WiFi.begin(ssid, password);
  unsigned long startAttemptTime = millis();

  const unsigned long timeout = 30000;
  const int maxRetries = 3;
  int retryCount = 0;
  unsigned long animTimer = 0;
  int animFrame = 0;
  bool animating = true;

  while (animating) {
    unsigned long now = millis();
    if (WiFi.status() == WL_CONNECTED) {
      Serial.println("[WIFI] Connected: " + WiFi.localIP().toString());
      isAPMode = false;

      WiFiMode_t mode = WiFi.getMode();
      Serial.printf("[WIFI] WiFi mode after STA connection: %s\n",
                    mode == WIFI_OFF ? "OFF" : mode == WIFI_STA    ? "STA ONLY"
                                             : mode == WIFI_AP     ? "AP ONLY"
                                             : mode == WIFI_AP_STA ? "AP + STA (Error!)"
                                                                   : "UNKNOWN");

      // --- IP Display initiation ---
      if (LittleFS.exists("/update_success.txt")) {
        // Use (char) to force the raw font glyphs and avoid the newline bug
        pendingIpToShow = String((char)10) + (char)11 + (char)32 + (char)173 + String(FIRMWARE_VERSION);
        LittleFS.remove("/update_success.txt");
        IP_SCROLL_SPEED = 70;
      } else {
        pendingIpToShow = WiFi.localIP().toString();
        IP_SCROLL_SPEED = 115;
        // Replace all dots with your custom font code 184
        for (int i = 0; i < pendingIpToShow.length(); i++) {
          if (pendingIpToShow[i] == '.') {
            pendingIpToShow[i] = 184;
          }
        }
      }

      showingIp = true;
      ipDisplayCount = 0;
      P.displayClear();
      P.setCharSpacing(1);
      textEffect_t actualScrollDirection = getEffectiveScrollDirection(PA_SCROLL_LEFT, flipDisplay);
      P.displayScroll(pendingIpToShow.c_str(), PA_CENTER, actualScrollDirection, IP_SCROLL_SPEED);
      // --- END IP Display initiation ---

      animating = false;  // Exit the connection loop
      break;
    } else if (now - startAttemptTime >= timeout) {

      if (retryCount < maxRetries - 1) {
        retryCount++;
        Serial.printf("[WIFI] Attempt failed. Retrying (%d/%d)...\n", retryCount + 1, maxRetries);

        WiFi.disconnect();
        delay(500);
        WiFi.begin(ssid, password);
        startAttemptTime = millis();  // reset timeout timer
      } else {
        Serial.println(F("[WIFI] All attempts failed. Starting AP mode..."));

        WiFi.mode(WIFI_AP);
        WiFi.softAP(DEFAULT_AP_SSID, DEFAULT_AP_PASSWORD);
        Serial.print(F("[WIFI] AP IP address: "));
        Serial.println(WiFi.softAPIP());
        dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
        isAPMode = true;

        WiFiMode_t mode = WiFi.getMode();
        Serial.printf("[WIFI] WiFi mode after STA failure and setting AP: %s\n",
                      mode == WIFI_OFF ? "OFF" : mode == WIFI_STA    ? "STA ONLY"
                                               : mode == WIFI_AP     ? "AP ONLY"
                                               : mode == WIFI_AP_STA ? "AP + STA (Error!)"
                                                                     : "UNKNOWN");

        animating = false;
        Serial.println(F("[WIFI] AP Mode Started"));
        break;
      }
    }
    if (now - animTimer > 750) {
      animTimer = now;
      P.setTextAlignment(PA_CENTER);
      switch (animFrame % 3) {
        case 0:
          {
            String s = "\003 ";
            s += char(169);
            P.print(s.c_str());
            break;
          }

        case 1:
          {
            String s = "\003 ";
            s += char(170);
            P.print(s.c_str());
            break;
          }

        case 2:
          {
            String s = "\003 ";
            s += char(171);
            P.print(s.c_str());
            break;
          }
      }
      animFrame++;
    }
    delay(1);
  }
}

