obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
  static const IconMap icons[] = {
    { "[NOTEMP]", "\x01", 25 },
    { "[NONTP]", "\x02", 20 },
    { "[WIFI]", "\x03", 13 },
    { "[INFO]", "\x04", 22 },
    { "[AP]", "\x05", 9 },
    { "[C]", "\x06", 4 },
    { "[F]", "\x07", 4 },
    { "[TIMEISUP]", "\x08", 32 },
    { "[TIMEISUPINVERTED]", "\x09", 32 },
    { "[SUNNY]", "\x0C", 8 },
    { "[CLOUDY]", "\x0D", 8 },
    { "[NODATA]", "\x0F", 23 },
    { "[RAINY]", "\x10", 8 },
    { "[THUNDER]", "\x11", 8 },
    { "[SNOWY]", "\x12", 8 },
    { "[WINDY]", "\x13", 8 },
    { "[CLOCK]", "\x14", 8 },
    { "[ALARM]", "\x15", 9 },
    { "[UPDATE]", "\x16", 8 },
    { "[BATTERYEMPTY]", "\x17", 8 },
    { "[BATTERY33]", "\x18", 8 },
    { "[BATTERY66]", "\x19", 8 },
    { "[BATTERYFULL]", "\x1A", 8 },
    { "[BOLT]", "\x1B", 4 },
    { "[HOUSE]", "\x1C", 7 },
    { "[TEMP]", "\x1D", 8 },
    { "[MUSICNOTE]", "\x1E", 7 },
    { "[PLAY]", "\x1F", 4 },
    { "[SPACE]", "\x20", 1 },
    { "[PAUSE]", "\x7F", 5 },
    { "[EURO]", "\x80", 5 },
    { "[SPEAKER]", "\x81", 8 },
    { "[SPEAKEROFF]", "\x82", 8 },
    { "[RED]", "\x83", 6 },
    { "[UP]", "\x86", 3 },
    { "[DOWN]", "\x88", 3 },
    { "[RIGHT]", "\x8B", 8 },
    { "[LEFT]", "\x8D", 8 },
    { "[TALK]", "\x8E", 7 },
    { "[HEART]", "\x8F", 7 },
    { "[CHECK]", "\x90", 5 },
    { "[INSTA]", "\x9B", 8 },
    { "[TV]", "\x9C", 11 },
    { "[YOUTUBE]", "\x9D", 8 },
    { "[BELL]", "\x9E", 6 },
    { "[LOCK]", "\x9F", 7 },
    { "[PERSON]", "\xA0", 6 },
    { "[HOURGLASS]", "\xA1", 5 },
    { "[HOURGLASS25]", "\xA2", 5 },
    { "[HOURGLASS75]", "\xA3", 5 },
    { "[HOURGLASSFULL]", "\xA4", 5 },
    { "[CAR]", "\xBB", 9 },
    { "[MAIL]", "\xA6", 9 },
    { "[CO2]", "\xA7", 13 },
    { "[MOON]", "\xA8", 9 },
    { "[SIGNAL1]", "\xA9", 8 },
    { "[SIGNAL2]", "\xAA", 8 },
    { "[SIGNAL3]", "\xAB", 8 },
    { "[DEG]", "\xB0", 3 },
    { "[SUNDAYJP]", "\xB1", 5 },
    { "[MONDAYJP]", "\xB2", 6 },
    { "[TUESDAYJP]", "\xB3", 7 },
    { "[WEDNESDAYJP]", "\xB4", 7 },
    { "[THURSDAYJP]", "\xB5", 7 },
    { "[FRIDAYJP]", "\xB6", 7 },
    { "[SATURDAYJP]", "\xB7", 7 },
    { "[MIST]", "\xB9", 7 }
  };

  // 1. Replace all tokens with glyphs first
  for (const auto &icon : icons) {
    msg.replace(icon.token, icon.glyph);
  }

  // 2. Calculate pixel width of the resulting string
  totalPixelWidth = 0;

  for (int i = 0; i < (int)msg.length(); i++) {
    bool isIcon = false;
    int charWidth = 0;
    unsigned char c = (unsigned char)msg[i];

    // Check for icons
    for (const auto &icon : icons) {
      if (c == (unsigned char)icon.glyph[0]) {
        charWidth = icon.pixelWidth;
        isIcon = true;
        break;
      }
    }

    if (!isIcon) {
      switch (c) {
        // --- 1 Pixel Wide ---
        case 32:  // Space
        case '!':
        case '.':
        case ':':
        case '\'':  // Single quote
        case '|':
        case 73:   // Capital 'I'
        case 184:  // Custom Dot (IP display)
          charWidth = 1;
          break;

        // --- 2 Pixels Wide ---
        case 40:  // (
        case 41:  // )
        case 59:  // ;
        case 91:  // [
        case 93:  // ]
        case ',':
          charWidth = 2;
          break;

        // --- 3 Pixels Wide ---
        case 34:
        case '?':
        case '-':
        case '_':  // Underscore
        case '/':
          charWidth = 3;
          break;

        // --- 4 Pixels Wide ---
        case 176:  // Degree symbol (Standard °)
          charWidth = 4;
          break;

        // --- 5 Pixels Wide ---
        case '#':
        case '&':
        case '$':
        case 0xA5:  //¥
        case '@':
        case '+':  // Moved here: 5px
          charWidth = 5;
          break;

        // --- 6 Pixels Wide ---
        case '%':
        case '~':
          charWidth = 6;
          break;

        // --- Default (Caps & Numbers) ---
        default:
          charWidth = 3;
          break;
      }
    }

    totalPixelWidth += charWidth;

    // Add 1px gap between characters/icons (except the last one)
    if (i < (int)msg.length() - 1) {
      totalPixelWidth += 1;
    }
  }
}

void handleCustomMessageLogic(AsyncWebServerRequest *request) {
  if (networkData.busy()) {
    Serial.println(F("[MESSAGE] Rejected: Network Busy"));
    AsyncWebServerResponse *busyResponse = request->beginResponse(503, "text/plain", "Network Busy");
    busyResponse->addHeader("Access-Control-Allow-Origin", "*");
    request->send(busyResponse);
    return;
  }

  if (request->hasArg("message")) {
    String msg = request->arg("message");
    msg.trim();

    bool isClearRequest = (msg.length() == 0);
    bool incomingAllowInterrupt = true;

    // Detect Source: Header or URL param
    bool isFromUI = (request->header("X-Source") == "UI") || (request->arg("source") == "UI");
    bool isFromAPI = !isFromUI;

    // 1. Interrupt (allowInterrupt / interrupt)
    if (request->hasArg("allowInterrupt")) {
      incomingAllowInterrupt = (request->arg("allowInterrupt") == "1");
    } else if (request->hasArg("interrupt")) {
      incomingAllowInterrupt = (request->arg("interrupt") == "1");
    }

    // 2. Seconds (seconds / duration)
    int rawSecs = request->hasArg("seconds") ? request->arg("seconds").toInt() : (request->hasArg("duration") ? request->arg("duration").toInt() : 0);
    int newMessageDisplaySeconds = constrain(rawSecs, 0, 3600);

    // 3. Scrolls (scrolltimes / scrolls / scroll_times)
    int rawScrolls = request->hasArg("scrolltimes") ? request->arg("scrolltimes").toInt() : (request->hasArg("scrolls") ? request->arg("scrolls").toInt() : (request->hasArg("scroll_times") ? request->arg("scroll_times").toInt() : 0));
    int newMessageScrollTimes = constrain(rawScrolls, 0, 100);

    // 4. Speed & Big Numbers
    bool newMessageBigNumbers = (request->arg("bignumbers") == "1");
    int rawSpeed = request->hasArg("speed") ? request->arg("speed").toInt() : GENERAL_SCROLL_SPEED;
    int localSpeed = constrain(rawSpeed, 10, 200);

    // PROTECTION: Clock-only dimming
    if (!isClearRequest && clockOnlyDuringDimming && dimActive) {
      Serial.printf("[MESSAGE] Rejected (Dimming Mode): '%s'\n", msg.c_str());
      request->send(409, "text/plain", "Clock-only dimming mode active");
      return;
    }

