obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
    // Handle Pomodoro Commands (checked before Timer)
    if (handlePomodoroCommand(msg)) {
      if (!allowInterrupt) {
        request->send(409, "text/plain", "Protected message active");
      } else if (clockOnlyDuringDimming && dimActive) {
        request->send(409, "text/plain", "Clock-only dimming active");
      } else {
        Serial.println(F("[MESSAGE] Pomodoro command executed."));
        request->send(200, "text/plain", "Pomodoro Command Executed");
      }
      return;
    }

    // Handle Timer Commands
    if (handleTimerCommand(msg)) {
      if (!allowInterrupt) {
        request->send(409, "text/plain", "Protected message active");
      } else if (clockOnlyDuringDimming && dimActive) {
        request->send(409, "text/plain", "Clock-only dimming active");
      } else {
        Serial.println(F("[MESSAGE] Timer command executed."));
        request->send(200, "text/plain", "Timer Command Executed");
      }
      return;
    }

    // PROTECTION: Timer Active
    if (timerActive && !isClearRequest && incomingAllowInterrupt) {
      Serial.println(F("[MESSAGE] Rejected: Timer is active."));
      request->send(409, "text/plain", "Timer active - use priority message");
      return;
    }

    // PROTECTION: Protected Message Running
    if (!isClearRequest && !allowInterrupt && incomingAllowInterrupt) {
      Serial.println(F("[MESSAGE] Rejected: Protected message running"));
      request->send(409, "text/plain", "Display busy");
      return;
    }

    String filtered = cleanTextForDisplay(msg);
    messageDisplaySeconds = newMessageDisplaySeconds;
    messageScrollTimes = newMessageScrollTimes;
    messageBigNumbers = newMessageBigNumbers;

    // --- LOG: Consolidated Intent (Before Saving/Execution) ---
    Serial.printf(
      "[MESSAGE] Source=%s | msg='%s' | seconds=%d | scrolls=%d | speed=%d | big=%d | allowInterrupt=%d\n",
      isFromUI ? "UI" : "API",
      filtered.c_str(),
      messageDisplaySeconds,
      messageScrollTimes,
      localSpeed,
      messageBigNumbers,
      incomingAllowInterrupt);

    if (timerActive && !isClearRequest) {
      displayMode = (messageScrollTimes == 0 && messageDisplaySeconds == 0) ? 6 : 7;
      lastSwitch = millis();
      forceMessageRestart = true;
    }

    // --- CLEAR MESSAGE ---
    if (isClearRequest) {
      allowInterrupt = true;
      forceMessageRestart = true;
      if (isFromUI) {
        customMessage[0] = '\0';
        lastPersistentMessage[0] = '\0';
        messageStartTime = 0;
        currentScrollCount = 0;
        messageDisplaySeconds = 0;
        messageScrollTimes = 0;
        displayMode = 0;
        prevDisplayMode = 6;
        lastSwitch = millis();
        clockScrollDone = false;
        saveCustomMessageToConfig("");
        Serial.println(F("[MESSAGE] Full Clear (UI) completed."));
        request->send(200, "text/plain", "CLEARED (UI)");
      } else {
        customMessage[0] = '\0';
        messageStartTime = 0;
        currentScrollCount = 0;
        messageDisplaySeconds = 0;
        messageScrollTimes = 0;

        if (strlen(lastPersistentMessage) > 0) {
          strlcpy(customMessage, lastPersistentMessage, sizeof(customMessage));
          messageScrollSpeed = GENERAL_SCROLL_SPEED;
          displayMode = 6;
          prevDisplayMode = 0;
          Serial.println(F("[MESSAGE] Temp message cleared. Persistent restored."));
          request->send(200, "text/plain", "CLEARED (API temporary, persistent restored)");
        } else {
          displayMode = 0;
          lastSwitch = millis();
          prevDisplayMode = 6;
          clockScrollDone = false;
          Serial.println(F("[MESSAGE] Temp message cleared. No persistent found."));
          request->send(200, "text/plain", "CLEARED (API temporary, no persistent)");
        }
      }
      return;
    }

    // --- STORE & ACTIVATE ---
    if (isFromAPI) {
      filtered.toCharArray(customMessage, sizeof(customMessage));
      messageScrollSpeed = localSpeed;
    } else {
      filtered.toCharArray(customMessage, sizeof(customMessage));
      strlcpy(lastPersistentMessage, customMessage, sizeof(lastPersistentMessage));
      messageScrollSpeed = GENERAL_SCROLL_SPEED;
      saveCustomMessageToConfig(lastPersistentMessage);
    }

    allowInterrupt = incomingAllowInterrupt;
    displayMode = 6;
    prevDisplayMode = 0;
    messageStartTime = millis();
    currentScrollCount = 0;
    clockScrollDone = false;
    forceMessageRestart = true;

    // --- FINAL RESPONSE ---
    String responseMsg = "OK (" + String(isFromUI ? "UI" : "API") + ")";
    AsyncWebServerResponse *response = request->beginResponse(200, "text/plain", responseMsg);
    response->addHeader("Access-Control-Allow-Origin", "*");
    request->send(response);
  } else {
    Serial.println(F("[MESSAGE] Error: Missing message parameter"));
    request->send(400, "text/plain", "Missing message parameter");
  }
}

// -----------------------------------------------------------------------------
// Web Server and Captive Portal
// -----------------------------------------------------------------------------
void handleCaptivePortal(AsyncWebServerRequest *request);

void setupWebServer() {
  Serial.println(F("[WEBSERVER] Setting up web server..."));

  // 1. Global CORS headers (Required for Chrome Extension)
  // These headers allow the browser to verify the security policy for all routes.
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "Content-Type, X-Source");

  // Root handler with BOTH CORS and Cache-Prevention
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    AsyncWebServerResponse *response = request->beginResponse(200, "text/html", index_html);
    // Anti-Caching Headers: Ensures the browser always fetches the latest UI
    response->addHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    response->addHeader("Pragma", "no-cache");
    response->addHeader("Expires", "0");
    // CORS Header (Manual insurance for strict browser scrutiny)
    response->addHeader("Access-Control-Allow-Origin", "*");
    request->send(response);
  });

  server.on("/config.json", HTTP_GET, [](AsyncWebServerRequest *request) {
    Serial.println(F("[WEBSERVER] Request: /config.json"));
    File f = LittleFS.open("/config.json", "r");
    if (!f) {
      Serial.println(F("[WEBSERVER] Error opening /config.json"));
      request->send(500, "application/json", "{\"error\":\"Failed to open config.json\"}");
      return;
    }
    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();
    if (err) {
      Serial.print(F("[WEBSERVER] Error parsing /config.json: "));
      Serial.println(err.f_str());
      request->send(500, "application/json", "{\"error\":\"Failed to parse config.json\"}");
      return;
    }

    // Always sanitize before sending to browser
    doc[F("ssid")] = getSafeSsid();
    doc[F("password")] = getSafePassword();
    doc[F("openWeatherApiKey")] = getSafeApiKey();
    doc[F("mode")] = isAPMode ? "ap" : "sta";

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  server.on("/save", HTTP_POST, [](AsyncWebServerRequest *request) {
    Serial.println(F("[WEBSERVER] Request: /save"));
    JsonDocument doc;

    File configFile = LittleFS.open("/config.json", "r");
    if (configFile) {
      Serial.println(F("[WEBSERVER] Existing config.json found, loading for update..."));
      DeserializationError err = deserializeJson(doc, configFile);
      configFile.close();
      if (err) {
        Serial.print(F("[WEBSERVER] Error parsing existing config.json: "));
        Serial.println(err.f_str());
      }
    } else {
      Serial.println(F("[WEBSERVER] config.json not found, starting with empty doc for save."));
    }

    for (int i = 0; i < request->params(); i++) {
      const AsyncWebParameter *p = request->getParam(i);
      String n = p->name();
      String v = p->value();

      if (n == "brightness") doc[n] = v.toInt();
      else if (n == "clockDuration") doc[n] = v.toInt();
      else if (n == "weatherDuration") doc[n] = v.toInt();
      else if (n == "flipDisplay") doc[n] = (v == "true" || v == "on" || v == "1");
      else if (n == "twelveHourToggle") doc[n] = (v == "true" || v == "on" || v == "1");
      else if (n == "showDayOfWeek") doc[n] = (v == "true" || v == "on" || v == "1");
      else if (n == "showDate") doc[n] = (v == "true" || v == "on" || v == "1");
      else if (n == "showHumidity") doc[n] = (v == "true" || v == "on" || v == "1");
      else if (n == "colonBlinkEnabled") doc[n] = (v == "true" || v == "on" || v == "1");
      else if (n == "dimStartHour") doc[n] = v.toInt();
      else if (n == "dimStartMinute") doc[n] = v.toInt();
      else if (n == "dimEndHour") doc[n] = v.toInt();
      else if (n == "dimEndMinute") doc[n] = v.toInt();
      else if (n == "dimBrightness") {
        if (v == "Off" || v == "off") doc[n] = -1;
        else doc[n] = v.toInt();
      } else if (n == "showWeatherDescription") doc[n] = (v == "true" || v == "on" || v == "1");
      else if (n == "dimmingEnabled") doc[n] = (v == "true" || v == "on" || v == "1");
      else if (n == "clockOnlyDuringDimming") {
        doc[n] = (v == "true" || v == "on" || v == "1");
      } else if (n == "weatherUnits") doc[n] = v;
      else if (n == "hostname") doc[n] = v;
      else if (n == "password") {
        if (v != "********") {
          doc[n] = v;  // saves new password OR empty string (open network)
        } else {
          Serial.println(F("[SAVE] Password unchanged (masked)."));
        }
      } else if (n == "ssid") {
        if (v != "********" && v.length() > 0) {
          doc[n] = v;
        } else {
          Serial.println(F("[SAVE] SSID unchanged."));
        }
      } else if (n == "openWeatherApiKey") {
        if (v != "********************************") {  // ignore mask only
          doc[n] = v;                                   // save new key (even if empty)
          Serial.print(F("[SAVE] API key updated: "));
          Serial.println(v.length() == 0 ? "(empty)" : v);
        } else {
          Serial.println(F("[SAVE] API key unchanged (mask ignored)."));
        }
      } else {
        doc[n] = v;
      }
    }

    bool newCountdownEnabled = (request->hasParam("countdownEnabled", true) && (request->getParam("countdownEnabled", true)->value() == "true" || request->getParam("countdownEnabled", true)->value() == "on" || request->getParam("countdownEnabled", true)->value() == "1"));
    String countdownDateStr = request->hasParam("countdownDate", true) ? request->getParam("countdownDate", true)->value() : "";
    String countdownTimeStr = request->hasParam("countdownTime", true) ? request->getParam("countdownTime", true)->value() : "";
    String countdownLabelStr = request->hasParam("countdownLabel", true) ? request->getParam("countdownLabel", true)->value() : "";
    bool newIsDramaticCountdown = (request->hasParam("isDramaticCountdown", true) && (request->getParam("isDramaticCountdown", true)->value() == "true" || request->getParam("isDramaticCountdown", true)->value() == "on" || request->getParam("isDramaticCountdown", true)->value() == "1"));

    time_t newTargetTimestamp = 0;
    if (newCountdownEnabled && countdownDateStr.length() > 0 && countdownTimeStr.length() > 0) {
      int year = countdownDateStr.substring(0, 4).toInt();
      int month = countdownDateStr.substring(5, 7).toInt();
      int day = countdownDateStr.substring(8, 10).toInt();
      int hour = countdownTimeStr.substring(0, 2).toInt();
      int minute = countdownTimeStr.substring(3, 5).toInt();

      struct tm tm;
      tm.tm_year = year - 1900;
      tm.tm_mon = month - 1;
      tm.tm_mday = day;
      tm.tm_hour = hour;
      tm.tm_min = minute;
      tm.tm_sec = 0;
      tm.tm_isdst = -1;

