obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
      newTargetTimestamp = mktime(&tm);
      if (newTargetTimestamp == (time_t)-1) {
        Serial.println("[SAVE] Error converting countdown date/time to timestamp.");
        newTargetTimestamp = 0;
      } else {
        Serial.printf("[SAVE] Converted countdown target: %s -> %lu\n", countdownDateStr.c_str(), newTargetTimestamp);
      }
    }

    JsonObject countdownObj = doc["countdown"].to<JsonObject>();
    countdownObj["enabled"] = newCountdownEnabled;
    countdownObj["targetTimestamp"] = newTargetTimestamp;
    countdownObj["label"] = countdownLabelStr;
    countdownObj["isDramaticCountdown"] = newIsDramaticCountdown;

    size_t total = LittleFS.totalBytes();
    size_t used = LittleFS.usedBytes();
    Serial.printf("[SAVE] LittleFS total bytes: %llu, used bytes: %llu\n", LittleFS.totalBytes(), LittleFS.usedBytes());

    if (LittleFS.exists("/config.json")) {
      Serial.println(F("[SAVE] Renaming /config.json to /config.bak"));
      LittleFS.rename("/config.json", "/config.bak");
    }
    File f = LittleFS.open("/config.json", "w");
    if (!f) {
      Serial.println(F("[SAVE] ERROR: Failed to open /config.json for writing!"));
      JsonDocument errorDoc;
      errorDoc[F("error")] = "Failed to write config file.";
      String response;
      serializeJson(errorDoc, response);
      request->send(500, "application/json", response);
      return;
    }

    size_t bytesWritten = serializeJson(doc, f);
    Serial.printf("[SAVE] Bytes written to /config.json: %u\n", bytesWritten);
    f.close();
    Serial.println(F("[SAVE] /config.json file closed."));

    File verify = LittleFS.open("/config.json", "r");
    if (!verify) {
      Serial.println(F("[SAVE] ERROR: Failed to open /config.json for reading during verification!"));
      JsonDocument errorDoc;
      errorDoc[F("error")] = "Verification failed: Could not re-open config file.";
      String response;
      serializeJson(errorDoc, response);
      request->send(500, "application/json", response);
      return;
    }

    while (verify.available()) {
      verify.read();
    }
    verify.seek(0);

    JsonDocument test;
    DeserializationError err = deserializeJson(test, verify);
    verify.close();

    if (err) {
      Serial.print(F("[SAVE] Config corrupted after save: "));
      Serial.println(err.f_str());
      JsonDocument errorDoc;
      errorDoc[F("error")] = String("Config corrupted. Reboot cancelled. Error: ") + err.f_str();
      String response;
      serializeJson(errorDoc, response);
      request->send(500, "application/json", response);
      return;
    }

    Serial.println(F("[SAVE] Config verification successful."));
    JsonDocument okDoc;
    if (doc["hostname"].is<const char *>()) {
      deviceHostname = doc["hostname"].as<String>();
    }
    strlcpy(customMessage, doc["customMessage"] | "", sizeof(customMessage));
    okDoc[F("message")] = "Saved successfully. Rebooting...";
    String response;
    serializeJson(okDoc, response);
    request->send(200, "application/json", response);
    Serial.println(F("[WEBSERVER] Sending success response and scheduling reboot..."));

    request->onDisconnect([]() {
      Serial.println(F("[WEBSERVER] Client disconnected, rebooting ESP..."));
      saveUptime();
      isRebooting = true;
      delay(100);  // ensure file is written
      ESP.restart();
    });
  });

  server.on("/restore", HTTP_POST, [](AsyncWebServerRequest *request) {
    Serial.println(F("[WEBSERVER] Request: /restore"));
    if (LittleFS.exists("/config.bak")) {
      File src = LittleFS.open("/config.bak", "r");
      if (!src) {
        Serial.println(F("[WEBSERVER] Failed to open /config.bak"));
        JsonDocument errorDoc;
        errorDoc[F("error")] = "Failed to open backup file.";
        String response;
        serializeJson(errorDoc, response);
        request->send(500, "application/json", response);
        return;
      }
      File dst = LittleFS.open("/config.json", "w");
      if (!dst) {
        src.close();
        Serial.println(F("[WEBSERVER] Failed to open /config.json for writing"));
        JsonDocument errorDoc;
        errorDoc[F("error")] = "Failed to open config for writing.";
        String response;
        serializeJson(errorDoc, response);
        request->send(500, "application/json", response);
        return;
      }

      while (src.available()) {
        dst.write(src.read());
      }
      src.close();
      dst.close();

      JsonDocument okDoc;
      okDoc[F("message")] = "✅ Backup restored! Device will now reboot.";
      String response;
      serializeJson(okDoc, response);
      request->send(200, "application/json", response);
      request->onDisconnect([]() {
        Serial.println(F("[WEBSERVER] Rebooting after restore..."));
        saveUptime();
        delay(100);  // ensure file is written
        ESP.restart();
      });

    } else {
      Serial.println(F("[WEBSERVER] No backup found"));
      JsonDocument errorDoc;
      errorDoc[F("error")] = "No backup found.";
      String response;
      serializeJson(errorDoc, response);
      request->send(404, "application/json", response);
    }
  });

  server.on("/ap_status", HTTP_GET, [](AsyncWebServerRequest *request) {
    Serial.print(F("[WEBSERVER] Request: /ap_status. isAPMode = "));
    Serial.println(isAPMode);
    String json = "{\"isAP\": ";
    json += (isAPMode) ? "true" : "false";
    json += "}";
    request->send(200, "application/json", json);
  });

  auto setHandler = [](AsyncWebServerRequest *request) {
    String action = request->url().substring(5);  // strips "/set_" → e.g. "brightness"
    String value = "";
    if (request->hasParam("value", true)) {
      value = request->getParam("value", true)->value();
    } else if (request->params() > 0) {
      value = request->getParam(0)->value();
    }
    executeAction(action, value);
    request->send(200, "application/json", "{\"ok\":true}");
  };

  server.on("/set_brightness", HTTP_POST, setHandler);
  server.on("/set_flip", HTTP_POST, setHandler);
  server.on("/set_twelvehour", HTTP_POST, setHandler);
  server.on("/set_dayofweek", HTTP_POST, setHandler);
  server.on("/set_showdate", HTTP_POST, setHandler);
  server.on("/set_humidity", HTTP_POST, setHandler);
  server.on("/set_colon_blink", HTTP_POST, setHandler);
  server.on("/set_language", HTTP_POST, setHandler);
  server.on("/set_weatherdesc", HTTP_POST, setHandler);
  server.on("/set_units", HTTP_POST, setHandler);
  server.on("/set_countdown_enabled", HTTP_POST, setHandler);
  server.on("/set_dramatic_countdown", HTTP_POST, setHandler);
  server.on("/set_clock_only_dimming", HTTP_POST, setHandler);

  // --- Custom Message Endpoint ---
  server.on("/set_custom_message", HTTP_ANY, [](AsyncWebServerRequest *request) {
    if (request->method() == HTTP_OPTIONS) {
      AsyncWebServerResponse *response = request->beginResponse(200);
      response->addHeader("Access-Control-Allow-Origin", "*");
      response->addHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
      response->addHeader("Access-Control-Allow-Headers", "Content-Type, X-Source");
      request->send(response);
      return;
    }
    handleCustomMessageLogic(request);
  });


  // --- Physical Buttons: get config ---
  server.on("/get_buttons", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    JsonArray used = doc["usedPins"].to<JsonArray>();
    used.add(CLK_PIN);
    used.add(CS_PIN);
    used.add(DATA_PIN);
    JsonArray btns = doc["buttons"].to<JsonArray>();
    for (int i = 0; i < 4; i++) {
      JsonObject b = btns.add<JsonObject>();
      b["pin"] = btnCfg[i].pin;
      b["shortAction"] = btnCfg[i].shortAct;
      b["longAction"] = btnCfg[i].longAct;
    }
    String out;
    serializeJson(doc, out);
    request->send(200, "application/json", out);
  });

  // --- Physical Buttons: save config (config.json, no reboot) ---
  server.on("/save_buttons", HTTP_POST, [](AsyncWebServerRequest *request) {
    int forbidden[] = { CLK_PIN, CS_PIN, DATA_PIN };
    int newPins[4];
    String newShort[4], newLong[4];

