obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
    for (int i = 0; i < 4; i++) {
      String idx = String(i + 1);
      int pin = request->hasParam("btn" + idx + "_pin", true)
                  ? request->getParam("btn" + idx + "_pin", true)->value().toInt()
                  : -1;
      for (int f : forbidden) {
        if (pin == f) {
          pin = -1;
          break;
        }
      }
      newPins[i] = pin;
      newShort[i] = request->hasParam("btn" + idx + "_short", true)
                      ? request->getParam("btn" + idx + "_short", true)->value()
                      : "";
      newLong[i] = request->hasParam("btn" + idx + "_long", true)
                     ? request->getParam("btn" + idx + "_long", true)->value()
                     : "";
    }
    // Reject duplicate pins between buttons
    for (int i = 0; i < 4; i++)
      for (int j = i + 1; j < 4; j++)
        if (newPins[i] >= 0 && newPins[i] == newPins[j]) newPins[j] = -1;

    // Load existing config.json and patch the buttons key
    JsonDocument doc;
    File configFile = LittleFS.open("/config.json", "r");
    if (configFile) {
      deserializeJson(doc, configFile);
      configFile.close();
    }

    doc.remove("buttons");
    JsonArray arr = doc["buttons"].to<JsonArray>();
    for (int i = 0; i < 4; i++) {
      JsonObject b = arr.add<JsonObject>();
      b["pin"] = newPins[i];
      b["shortAction"] = newShort[i];
      b["longAction"] = newLong[i];
      // Update in-memory state immediately
      btnCfg[i].pin = newPins[i];
      btnCfg[i].shortAct = newShort[i];
      btnCfg[i].longAct = newLong[i];
    }

    if (LittleFS.exists("/config.json")) LittleFS.rename("/config.json", "/config.bak");
    File f = LittleFS.open("/config.json", "w");
    if (f) {
      serializeJson(doc, f);
      f.close();
    }

    setupButtons();  // apply new pinMode() without reboot
    Serial.println(F("[BUTTON] Config saved to config.json."));
    request->send(200, "application/json", "{\"ok\":true}");
  });

  server.onNotFound([](AsyncWebServerRequest *request) {
    if (request->method() == HTTP_OPTIONS) {
      AsyncWebServerResponse *response = request->beginResponse(200);
      response->addHeader("Access-Control-Allow-Origin", "*");
      response->addHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
      response->addHeader("Access-Control-Allow-Headers", "Content-Type, X-Source");
      request->send(response);
      return;
    }
    handleCaptivePortal(request);
  });

  server.on(
    "/action", HTTP_ANY, [](AsyncWebServerRequest *request) {
      if (request->method() == HTTP_OPTIONS) {
        AsyncWebServerResponse *response = request->beginResponse(200);
        response->addHeader("Access-Control-Allow-Origin", "*");
        response->addHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
        response->addHeader("Access-Control-Allow-Headers", "Content-Type, X-Source");
        request->send(response);
        return;
      }

      // Capture 'message' from either URL (GET) or Body (POST)
      if (request->hasArg("message")) {
        handleCustomMessageLogic(request);
      } else {
        // Handle other actions (brightness, etc.)
        if (request->params() > 0) {
          executeAction(request->getParam(0)->name(), request->getParam(0)->value());
          request->send(200, "text/plain", "OK");
        } else {
          request->send(400, "text/plain", "No parameters found");
        }
      }
    },
    NULL, [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      // This empty body handler is CRITICAL for AsyncWebServer
      // to parse 'application/x-www-form-urlencoded' POST data!
    });

  server.on("/scan", HTTP_GET, [](AsyncWebServerRequest *request) {
    int scanStatus = WiFi.scanComplete();

    // -2 means scan not triggered, -1 means scan in progress
    if (scanStatus < -1 || scanStatus == WIFI_SCAN_FAILED) {
      // Start the asynchronous scan
      WiFi.scanNetworks(true);
      request->send(202, "application/json", "{\"status\":\"processing\"}");
    } else if (scanStatus == -1) {
      // Scan is currently running
      request->send(202, "application/json", "{\"status\":\"processing\"}");
    } else {
      // Scan finished (scanStatus >= 0)
      String json = "[";
      for (int i = 0; i < scanStatus; ++i) {
        json += "{";
        json += "\"ssid\":\"" + WiFi.SSID(i) + "\",";
        json += "\"rssi\":" + String(WiFi.RSSI(i));
        json += "}";
        if (i < scanStatus - 1) json += ",";
      }
      json += "]";

      // Clean up scan results from memory
      WiFi.scanDelete();
      request->send(200, "application/json", json);
    }
  });

  server.on("/scan", HTTP_GET, [](AsyncWebServerRequest *request) {
    int scanStatus = WiFi.scanComplete();

    // -2 means scan not triggered, -1 means scan in progress
    if (scanStatus < -1 || scanStatus == WIFI_SCAN_FAILED) {
      // Start the asynchronous scan
      WiFi.scanNetworks(true);
      request->send(202, "application/json", "{\"status\":\"processing\"}");
    } else if (scanStatus == -1) {
      // Scan is currently running
      request->send(202, "application/json", "{\"status\":\"processing\"}");
    } else {
      // Scan finished (scanStatus >= 0)
      String json = "[";
      for (int i = 0; i < scanStatus; ++i) {
        json += "{";
        json += "\"ssid\":\"" + WiFi.SSID(i) + "\",";
        json += "\"rssi\":" + String(WiFi.RSSI(i));
        json += "}";
        if (i < scanStatus - 1) json += ",";
      }
      json += "]";

      // Clean up scan results from memory
      WiFi.scanDelete();
      request->send(200, "application/json", json);
    }
  });

  server.on("/ip", HTTP_GET, [](AsyncWebServerRequest *request) {
    String ip;

    if (WiFi.getMode() == WIFI_AP) {
      ip = WiFi.softAPIP().toString();  // usually 192.168.4.1
    } else if (WiFi.isConnected()) {
      ip = WiFi.localIP().toString();
    } else {
      ip = "—";
    }

    request->send(200, "text/plain", ip);
  });

  server.on("/uptime", HTTP_GET, [](AsyncWebServerRequest *request) {
    // 1. Get Total Lifetime (from LittleFS)
    unsigned long totalSeconds = 0;
    if (LittleFS.exists("/uptime.dat")) {
      File f = LittleFS.open("/uptime.dat", "r");
      if (f) {
        totalSeconds = f.readString().toInt();
        f.close();
      }
    }

    // 2. Calculate Session Uptime (Time since boot)
    unsigned long sessionSeconds = millis() / 1000;

    // 3. Build the combined JSON
    String json = "{";
    json += "\"hostname\":\"" + deviceHostname + "\",";
    json += "\"total_seconds\":" + String(totalSeconds) + ",";
    json += "\"total_formatted\":\"" + formatUptime(totalSeconds) + "\",";
    json += "\"session_seconds\":" + String(sessionSeconds) + ",";
    json += "\"session_formatted\":\"" + formatUptime(sessionSeconds) + "\",";
    json += "\"version\":\"" FIRMWARE_VERSION "\"";
    json += "}";

    request->send(200, "application/json", json);
  });

  server.on("/status", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;

