obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
    // --- Identity ---
    doc["id"] = deviceHostname;
    doc["version"] = FIRMWARE_VERSION;
    doc["hardware"] = "MAX7219_FC16";
#if defined(ESP32)
    doc["board"] = "ESP32";
#elif defined(ESP8266)
      doc["board"] = "ESP8266";
#else
      doc["board"] = "unknown";
#endif

    // --- Display & Mode ---
    doc["displayMode"] = displayMode;
    doc["displayBusy"] = (displayMode == 6 || displayMode == 7);
    doc["allowInterrupt"] = allowInterrupt;

    SnsType snsType = detectSnsType(String(ntpServer2));
    switch (displayMode) {
      case 0: doc["mode"] = "clock"; break;
      case 1: doc["mode"] = "weather"; break;
      case 2: doc["mode"] = "weather_desc"; break;
      case 3: doc["mode"] = "countdown"; break;
      case 4:
        if (snsType == SNS_YOUTUBE) doc["mode"] = "youtube";
        else if (snsType == SNS_INSTAGRAM) doc["mode"] = "instagram";
        else doc["mode"] = "nightscout";
        break;
      case 5: doc["mode"] = "date"; break;
      case 6: doc["mode"] = "message"; break;
      case 7: doc["mode"] = "timer"; break;
      default: doc["mode"] = "cycling"; break;
    }

    doc["message"] = (strlen(customMessage) > 0) ? customMessage : "";
    doc["displayOff"] = displayOff;
    doc["brightness"] = brightness;
    doc["lastBrightnessBeforeOff"] = lastBrightnessBeforeOff;


    // --- Runtime ---
    doc["device_runtime"] = formatTotalRuntime();
    doc["session_runtime"] = millis() / 1000;
    doc["wifi_signal"] = WiFi.RSSI();
    doc["mdns_url"] = String(deviceHostname) + ".local";
    doc["time_synced"] = ntpSyncSuccessful;

    // --- Local Time & Epoch ---
    time_t nowTime = time(nullptr);
    struct tm timeinfo;
    localtime_r(&nowTime, &timeinfo);
    char buffer[20];
    strftime(buffer, sizeof(buffer), "%H:%M:%S", &timeinfo);
    doc["localTime"] = String(buffer);
    doc["epochTime"] = static_cast<uint32_t>(nowTime);

    // --- Countdown ---
    JsonObject cd = doc["countdown"].to<JsonObject>();
    cd["enabled"] = countdownEnabled;
    cd["targetTimestamp"] = countdownTargetTimestamp;
    cd["label"] = String(countdownLabel);
    cd["isDramatic"] = isDramaticCountdown;

    long long remaining = static_cast<long long>(countdownTargetTimestamp) - static_cast<long long>(nowTime);
    cd["remaining"] = countdownEnabled ? (remaining > 0 ? remaining : 0) : 0;

    doc["countdownEnabled"] = countdownEnabled;
    doc["countdownLabel"] = String(countdownLabel);

    // --- Weather ---
    JsonObject weather = doc["weather"].to<JsonObject>();

    if (weatherAvailable && weatherDescription.length() > 0) {
      weather["currentTemperature"] = String(currentTemp).toInt();
      weather["weatherDescription"] = weatherDescription;
      weather["icon"] = weatherIcon;
    } else {
      weather["currentTemperature"] = JsonVariant();
      weather["weatherDescription"] = JsonVariant();
      weather["icon"] = JsonVariant();
    }

    weather["currentHumidity"] = (weatherAvailable && weatherDescription.length() > 0) ? currentHumidity : JsonVariant();
    weather["sunriseHour"] = weatherAvailable ? sunriseHour : JsonVariant();
    weather["sunriseMinute"] = weatherAvailable ? sunriseMinute : JsonVariant();
    weather["sunsetHour"] = weatherAvailable ? sunsetHour : JsonVariant();
    weather["sunsetMinute"] = weatherAvailable ? sunsetMinute : JsonVariant();

    // --- Nightscout info ---
#if defined(ESP32) || defined(ESP8266)
    JsonObject ns = doc["nightscout"].to<JsonObject>();
    ns["active"] = (displayMode == 4);
    if (currentGlucose != -1) ns["glucose"] = currentGlucose;
    else ns["glucose"] = nullptr;
    if (currentDirection.length() > 0 && currentDirection != "?") ns["trend"] = currentDirection;
    else ns["trend"] = nullptr;

    if (lastGlucoseTime > 0) {
      ns["lastReadingEpoch"] = lastGlucoseTime;
      time_t nowUTC = time(nullptr);
      int minutes = static_cast<int>(difftime(nowUTC, lastGlucoseTime) / 60.0);
      ns["minutesSinceReading"] = (minutes > 0) ? minutes : 0;
      ns["isOutdated"] = (minutes > NIGHTSCOUT_IDLE_THRESHOLD_MIN);
    } else {
      ns["lastReadingEpoch"] = nullptr;
      ns["minutesSinceReading"] = nullptr;
      ns["isOutdated"] = true;
    }
#endif

    // --- SNS info (YouTube / Instagram) ---
    JsonObject sns = doc["sns"].to<JsonObject>();
    switch (snsType) {
      case SNS_YOUTUBE: sns["type"] = "youtube"; break;
      case SNS_INSTAGRAM: sns["type"] = "instagram"; break;
      case SNS_NIGHTSCOUT: sns["type"] = "nightscout"; break;
      case SNS_RSS: sns["type"] = "rss"; break;
      default: sns["type"] = "none"; break;
    }
    sns["youtubeSubscribers"] = (youtubeSubscribers >= 0) ? youtubeSubscribers : JsonVariant();
    sns["instagramFollowers"] = (instagramFollowers >= 0) ? instagramFollowers : JsonVariant();
    sns["rssTitle"] = (rssTitle.length() > 0) ? rssTitle : JsonVariant();

    // --- Saved Config ---
    JsonObject config = doc["config"].to<JsonObject>();
    config["ssid"] = String(ssid);
    config["openWeatherApiKey"] = (strlen(openWeatherApiKey) > 0) ? "***HIDDEN***" : "";
    config["openWeatherCity"] = String(openWeatherCity);
    config["weatherUnits"] = String(weatherUnits);
    config["clockDuration"] = clockDuration;
    config["weatherDuration"] = weatherDuration;
    config["timeZone"] = String(timeZone);
    config["language"] = String(language);
    config["flipDisplay"] = flipDisplay;
    config["twelveHourToggle"] = twelveHourToggle;
    config["showDate"] = showDate;
    config["showHumidity"] = showHumidity;
    config["ntpServer1"] = String(ntpServer1);

    String nsUrl = String(ntpServer2);
    int tokenIdx = nsUrl.indexOf("token=");
    if (tokenIdx == -1) tokenIdx = nsUrl.indexOf("api_key=");

    if (tokenIdx != -1) {
      int keyStart = nsUrl.indexOf('=', tokenIdx) + 1;
      config["ntpServer2"] = nsUrl.substring(0, keyStart) + "***HIDDEN***";
    } else {
      config["ntpServer2"] = nsUrl;
    }

    // --- Dimming ---
    JsonObject dimming = doc["dimming"].to<JsonObject>();
    dimming["dimmingEnabled"] = dimmingEnabled;
    dimming["dimStartHour"] = dimStartHour;
    dimming["dimStartMinute"] = dimStartMinute;
    dimming["dimEndHour"] = dimEndHour;
    dimming["dimEndMinute"] = dimEndMinute;
    dimming["autoDimmingEnabled"] = autoDimmingEnabled;
    dimming["clockOnlyDuringDimming"] = clockOnlyDuringDimming;


