obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
    // --- Pins ---
    JsonObject pins = doc["pins"].to<JsonObject>();
    pins["clk"] = CLK_PIN;
    pins["cs"] = CS_PIN;
    pins["data"] = DATA_PIN;

    // --- buttons ---
    JsonArray buttons = doc["buttons"].to<JsonArray>();

    for (int i = 0; i < 4; i++) {
      JsonObject b = buttons.add<JsonObject>();
      b["pin"] = btnCfg[i].pin;
      b["shortAction"] = btnCfg[i].shortAct;
      b["longAction"] = btnCfg[i].longAct;
    }

    String response;
    serializeJsonPretty(doc, response);
    AsyncWebServerResponse *res = request->beginResponse(200, "application/json", response);
    res->addHeader("Access-Control-Allow-Origin", "*");
    res->addHeader("Access-Control-Allow-Methods", "GET, OPTIONS");
    request->send(res);
  });

  server.on("/export", HTTP_GET, [](AsyncWebServerRequest *request) {
    Serial.println(F("[WEBSERVER] Request: /export"));

    File f;
    if (LittleFS.exists("/config.json")) {
      f = LittleFS.open("/config.json", "r");
      Serial.println(F("[EXPORT] Using /config.json"));
    } else if (LittleFS.exists("/config.bak")) {
      f = LittleFS.open("/config.bak", "r");
      Serial.println(F("[EXPORT] /config.json not found, using /config.bak"));
    } else {
      request->send(404, "application/json", "{\"error\":\"No config found\"}");
      return;
    }

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, f);
    f.close();
    if (err) {
      Serial.print(F("[EXPORT] Error parsing config: "));
      Serial.println(err.f_str());
      request->send(500, "application/json", "{\"error\":\"Failed to parse config\"}");
      return;
    }

    // Only sanitize if NOT in AP mode
    if (!isAPMode) {
      doc["ssid"] = "********";
      doc["password"] = "********";
      doc["openWeatherApiKey"] = "********************************";
    }

    doc["mode"] = isAPMode ? "ap" : "sta";

    String jsonOut;
    serializeJsonPretty(doc, jsonOut);

    AsyncWebServerResponse *resp = request->beginResponse(200, "application/json", jsonOut);
    resp->addHeader("Content-Disposition", "attachment; filename=\"config.json\"");
    request->send(resp);
  });

  server.on("/upload", HTTP_GET, [](AsyncWebServerRequest *request) {
    String html = R"rawliteral(
    <!DOCTYPE html>
    <html>
      <head>
        <meta charset="UTF-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1" />
         <style>
            html{
                background: linear-gradient(135deg, #081f56 0%, #110f2e 50%, #441a65 100%);
                height: 100%;
            }

            body {
                border: solid 1px rgba(255, 255, 255, 0.12);
                transition: opacity 0.6s cubic-bezier(.4, 0, .2, 1);
                max-width: 300px;
                margin: 4rem auto;
                background: rgba(255, 255, 255, 0.04);
                border-radius: 24px;
                text-align: center;
                font-family: Roboto, system-ui;
                /* margin: 0; */
                padding: 2rem 1rem;
                color: #ffffff;
                background-repeat: no-repeat, repeat, repeat;
                line-height: 1.5;
                -webkit-font-smoothing: antialiased;
                -moz-osx-font-smoothing: grayscale;
                box-shadow: 0 10px 36px 0 rgba(40, 170, 255, 0.11), 0 2px 8px 0 rgba(44, 70, 110, 0.08);
              }
            
            h3 {
              margin-top: 0;
              }

            input::file-selector-button {
              background: #0ea5e9;
              color: white;
              padding: 0.9rem 1.8rem;
              font-size: 1rem;
              font-weight: 600;
              border: none;
              border-radius: 999px;
              cursor: pointer;
              text-align: center;
              transition: background 0.25s, transform 0.15s 
              ease-in-out;
              margin-right: 0.5rem;
            }
          </style>
      </head>
      <body>
        <h3>Upload config.json</h3>
        <form method="POST" action="/upload" enctype="multipart/form-data">
          <input type="file" name="file" accept=".json" id="fileInput" onchange="this.form.submit()">
        </form>
      </body>
    </html>
  )rawliteral";
    request->send(200, "text/html", html);
  });

  server.on(
    "/upload", HTTP_POST, [](AsyncWebServerRequest *request) {
      String html = R"rawliteral(
      <!DOCTYPE html>
      <html>
        <head>
          <meta charset="UTF-8" />
          <meta name="viewport" content="width=device-width, initial-scale=1" />
          <title>Upload Successful</title>
          <meta http-equiv="refresh" content="1; url=/" />
          <style>
            html{
                background: linear-gradient(135deg, #081f56 0%, #110f2e 50%, #441a65 100%);
                height: 100%;
            }

            body {
                border: solid 1px rgba(255, 255, 255, 0.12);
                transition: opacity 0.6s cubic-bezier(.4, 0, .2, 1);
                max-width: 300px;
                margin: 4rem auto;
                background: rgba(255, 255, 255, 0.04);
                border-radius: 24px;
                text-align: center;
                font-family: Roboto, system-ui;
                /* margin: 0; */
                padding: 2rem 1rem;
                color: #ffffff;
                background-repeat: no-repeat, repeat, repeat;
                line-height: 1.5;
                -webkit-font-smoothing: antialiased;
                -moz-osx-font-smoothing: grayscale;
                box-shadow: 0 10px 36px 0 rgba(40, 170, 255, 0.11), 0 2px 8px 0 rgba(44, 70, 110, 0.08);
              }
            
            h3 {
              margin-top: 0;
              }

            input::file-selector-button {
              background: #0ea5e9;
              color: white;
              padding: 0.9rem 1.8rem;
              font-size: 1rem;
              font-weight: 600;
              border: none;
              border-radius: 999px;
              cursor: pointer;
              text-align: center;
              transition: background 0.25s, transform 0.15s 
              ease-in-out;
              margin-right: 0.5rem;
            }
          </style>
        </head>
        <body>
          <h3>File uploaded successfully!</h3>
          <p>Returning to main page...</p>
        </body>
      </html>
    )rawliteral";
      request->send(200, "text/html", html);
      // Restart after short delay to let browser handle redirect
      request->onDisconnect([]() {
        delay(500);  // ensure response is sent
        ESP.restart();
      });
    },
    [](AsyncWebServerRequest *request, const String &filename, size_t index, uint8_t *data, size_t len, bool final) {
      static File f;
      if (index == 0) {
        f = LittleFS.open("/config.json", "w");  // start new file
      }
      if (f) f.write(data, len);  // write chunk
      if (final) f.close();       // finish file
    });

  server.on("/get_version", HTTP_GET, [](AsyncWebServerRequest *request) {
    String json = "{";
    json += "\"version\":\"" + String(FIRMWARE_VERSION) + "\",";
    json += "\"board\":\"" + String(BOARD_TYPE) + "\"";
    json += "}";
    request->send(200, "application/json", json);
  });

  server.on("/perform_update", HTTP_GET, [](AsyncWebServerRequest *request) {
    otaState.updating = true;

    // Immediate UI Feedback
    P.displayClear();
    P.setTextAlignment(PA_CENTER);
    delay(100);
    P.print((char)172);  // Show your download/update icon

    request->send(200, "application/json", "{\"status\":\"ready\"}");
  });

  server.on(
    "/upload_ota", HTTP_POST, [](AsyncWebServerRequest *request) {
      if (!Update.hasError()) {
        request->send(200, "text/plain", "OK");
        // Set flags to reboot in the main loop
        otaState.restartPending = true;
        otaState.restartRequestedAt = millis();
      } else {
        request->send(200, "text/plain", "FAIL");
      }
    },
    [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
      // This runs for every chunk of data received
      if (!index) {
        Serial.printf("[OTA] Start: %s\n", filename.c_str());

