obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
  str.replace("é", "e");
  str.replace("è", "e");
  str.replace("ê", "e");
  str.replace("ë", "e");
  str.replace("ē", "e");
  str.replace("ė", "e");
  str.replace("ę", "e");

  str.replace("ğ", "g");
  str.replace("ģ", "g");

  str.replace("ĥ", "h");

  str.replace("í", "i");
  str.replace("ì", "i");
  str.replace("î", "i");
  str.replace("ï", "i");
  str.replace("ī", "i");
  str.replace("į", "i");

  str.replace("ĵ", "j");

  str.replace("ķ", "k");

  str.replace("ľ", "l");
  str.replace("ł", "l");

  str.replace("ñ", "n");
  str.replace("ń", "n");
  str.replace("ņ", "n");

  str.replace("ó", "o");
  str.replace("ò", "o");
  str.replace("ô", "o");
  str.replace("ö", "o");
  str.replace("õ", "o");
  str.replace("ø", "o");
  str.replace("ō", "o");
  str.replace("ő", "o");

  str.replace("œ", "oe");

  str.replace("ŕ", "r");

  str.replace("ś", "s");
  str.replace("š", "s");
  str.replace("ș", "s");
  str.replace("ŝ", "s");

  str.replace("ß", "ss");

  str.replace("ť", "t");
  str.replace("ț", "t");

  str.replace("ú", "u");
  str.replace("ù", "u");
  str.replace("û", "u");
  str.replace("ü", "u");
  str.replace("ū", "u");
  str.replace("ů", "u");
  str.replace("ű", "u");

  str.replace("ŵ", "w");

  str.replace("ý", "y");
  str.replace("ÿ", "y");
  str.replace("ŷ", "y");

  str.replace("ž", "z");
  str.replace("ź", "z");
  str.replace("ż", "z");

  str.toUpperCase();

  String result = "";
  for (unsigned int i = 0; i < str.length(); i++) {
    unsigned char c = (unsigned char)str.charAt(i);  // Use unsigned for safety

    // MASTER FILTER: Expanded for Modern Smart Home Notifications
    if ((c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z') || (c >= '0' && c <= '9') || strchr(" !.?:,;'\"-_+%/[]()#&¥$ ;|°@^~*=<>\t\n\r\\{}", c)) {
      result += (char)c;
    }
  }
  return result;  // Return the cleaned string
}











// -----------------------------------------------------------------------------
// Pomodoro Command Handler
// Syntax: [POMODORO W-B]  where W = work minutes (1-60), B = break minutes (1-60)
//         [POMODORO STOP]    — stop and return to clock
//         [POMODORO RESTART] — restart from the beginning of the work phase
// -----------------------------------------------------------------------------
bool handlePomodoroCommand(String cmd) {
  cmd.toUpperCase();
  if (cmd.indexOf("[POMODORO") == -1 && cmd.indexOf("[POM]") == -1 && cmd.indexOf("[POM ") == -1) return false;
  // Prevent starting or restarting Pomodoro while Clock-only Dimming is active
  if (clockOnlyDuringDimming && dimActive) {
    bool isStop = cmd.indexOf("[POM STOP]") != -1 || cmd.indexOf("[POMODORO STOP]") != -1;
    bool isPause = cmd.indexOf("[POM PAUSE]") != -1 || cmd.indexOf("[POMODORO PAUSE]") != -1;
    bool isResume = cmd.indexOf("[POM RESUME]") != -1 || cmd.indexOf("[POMODORO RESUME]") != -1;
    if (!isStop && !isPause && !isResume) {
      Serial.println(F("[POMODORO] Ignored: Clock-only Dimming is active."));
      return true;
    }
  }
  // Prevent starting/restarting Pomodoro while a protected message is active
  if (!allowInterrupt) {
    bool isStop = cmd.indexOf("[POM STOP]") != -1 || cmd.indexOf("[POMODORO STOP]") != -1;
    bool isPause = cmd.indexOf("[POM PAUSE]") != -1 || cmd.indexOf("[POMODORO PAUSE]") != -1;
    bool isResume = cmd.indexOf("[POM RESUME]") != -1 || cmd.indexOf("[POMODORO RESUME]") != -1;
    if (!isStop && !isPause && !isResume) {
      Serial.println(F("[POMODORO] Ignored: Protected message is active."));
      return true;
    }
  }

  // --- STOP ---
  if (cmd.indexOf("[POM STOP]") != -1 || cmd.indexOf("[POMODORO STOP]") != -1) {
    isPomodoroActive = false;
    pomodoroInBreak = false;
    timerActive = false;
    timerFinished = false;
    timerPaused = false;
    isStopwatch = false;
    displayMode = 0;
    prevDisplayMode = 6;
    clockScrollDone = false;
    forceMessageRestart = true;
    lastSwitch = millis();
    Serial.println(F("[POMODORO] Stopped. Returning to Clock."));
    return true;
  }

  // --- RESTART — restart from the beginning of the work phase ---
  if (cmd.indexOf("[POM RESTART]") != -1 || cmd.indexOf("[POMODORO RESTART]") != -1) {
    if (isPomodoroActive && pomodoroWorkMs > 0) {
      pomodoroInBreak = false;
      isStopwatch = false;
      timerOriginalDuration = pomodoroWorkMs;
      timerEndTime = millis() + pomodoroWorkMs;
      timerActive = true;
      timerPaused = false;
      timerFinished = false;
      timerSubState = 0;
      displayMode = 7;
      allowInterrupt = true;
      lastSwitch = millis();
      forceMessageRestart = true;
      Serial.println(F("[POMODORO] Restarted — beginning work phase."));
      return true;
    }
    return false;
  }

  // --- PAUSE ---
  if (cmd.indexOf("[POM PAUSE]") != -1 || cmd.indexOf("[POMODORO PAUSE]") != -1) {
    Serial.println(F("[POMODORO] Pause forwarded to timer."));
    return handleTimerCommand("[TIMER PAUSE]");
  }

  // --- RESUME ---
  if (cmd.indexOf("[POM RESUME]") != -1 || cmd.indexOf("[POMODORO RESUME]") != -1) {
    Serial.println(F("[POMODORO] Resume forwarded to timer."));
    return handleTimerCommand("[TIMER RESUME]");
  }

  // Shortcuts: [POM] or bare [POMODORO] (no params) default to 25-5-15
  String trimmed = cmd;
  trimmed.trim();
  if (cmd.indexOf("[POM]") != -1 || (cmd.indexOf("[POMODORO]") != -1 && cmd.indexOf("[POMODORO ") == -1)) {
    pomodoroWorkMs = 25 * 60000UL;
    pomodoroBreakMs = 5 * 60000UL;
    pomodoroLongBreakMs = 15 * 60000UL;
    pomodoroSession = 1;
    isPomodoroActive = true;
    pomodoroInBreak = false;
    isStopwatch = false;
    timerOriginalDuration = pomodoroWorkMs;
    timerEndTime = millis() + pomodoroWorkMs;
    timerActive = true;
    timerPaused = false;
    timerFinished = false;
    timerSubState = 0;
    displayMode = 7;
    allowInterrupt = true;
    lastSwitch = millis();
    forceMessageRestart = true;
    Serial.println(F("[POMODORO] Default 25-5-15 started."));
    return true;
  }

  // --- [POMODORO W-B] — parse work and break minutes ---
  int pomStart = cmd.indexOf("[POMODORO ") + 10;
  int pomEnd = cmd.indexOf("]", pomStart);
  if (pomEnd == -1) return false;
  String params = cmd.substring(pomStart, pomEnd);
  params.trim();

  int dash1 = params.indexOf('-');
  if (dash1 == -1) return false;
  int dash2 = params.indexOf('-', dash1 + 1);

  int workMin = params.substring(0, dash1).toInt();
  int breakMin = params.substring(dash1 + 1, dash2 == -1 ? params.length() : dash2).toInt();
  int longMin = (dash2 != -1) ? params.substring(dash2 + 1).toInt() : 15;

