obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
  if (workMin < 1) workMin = 1;
  if (workMin > 60) workMin = 60;
  if (breakMin < 1) breakMin = 1;
  if (breakMin > 60) breakMin = 60;
  if (longMin < 1) longMin = 1;
  if (longMin > 60) longMin = 60;

  pomodoroWorkMs = (unsigned long)workMin * 60000UL;
  pomodoroBreakMs = (unsigned long)breakMin * 60000UL;
  pomodoroLongBreakMs = (unsigned long)longMin * 60000UL;
  pomodoroSession = 1;
  isPomodoroActive = true;
  pomodoroInBreak = false;

  // Start the work-phase countdown
  isStopwatch = false;
  timerOriginalDuration = pomodoroWorkMs;
  timerEndTime = millis() + pomodoroWorkMs;
  timerActive = true;
  timerPaused = false;
  timerFinished = false;
  timerSubState = 0;
  displayMode = 7;
  allowInterrupt = true;
  lastSwitch = millis();
  forceMessageRestart = true;

  Serial.printf("[POMODORO] Started: %d min work / %d min break\n", workMin, breakMin);
  return true;
}

// Timer Helper
bool handleTimerCommand(String cmd) {
  cmd.toUpperCase();
  if (cmd.indexOf("[STOPWATCH]") != -1) cmd = "[TIMER STOPWATCH]";
  if (cmd.indexOf("[STOPWATCH PAUSE]") != -1) cmd = "[TIMER PAUSE]";
  if (cmd.indexOf("[STOPWATCH RESUME]") != -1) cmd = "[TIMER RESUME]";
  if (cmd.indexOf("[STOPWATCH STOP]") != -1) cmd = "[TIMER STOP]";
  if (cmd.indexOf("[STOPWATCH CLEAR]") != -1) cmd = "[TIMER CLEAR]";
  if (cmd.indexOf("[STOPWATCH RESTART]") != -1) cmd = "[TIMER STOPWATCH]";
  if (cmd.indexOf("[STOPWATCH RESET]") != -1) cmd = "[TIMER RESET]";
  if (cmd.indexOf("[TIMER") == -1) return false;

  int start = cmd.indexOf("[TIMER") + 6;
  int end = cmd.indexOf("]", start);
  String payload = cmd.substring(start, end);
  payload.trim();

  // Prevent starting or resuming timers while Clock-only Dimming is active
  if (clockOnlyDuringDimming && dimActive) {
    if (payload != "STOP" && payload != "CANCEL" && payload != "CLEAR" && payload != "PAUSE" && payload != "RESET") {
      Serial.println(F("[TIMER] Ignored: Clock-only Dimming is active."));
      return true;
    }
  }

  // Prevent starting or resuming timers while a protected message is active
  if (!allowInterrupt) {
    if (payload != "STOP" && payload != "CANCEL" && payload != "CLEAR" && payload != "PAUSE" && payload != "RESET") {
      Serial.println(F("[TIMER] Ignored: Protected message is active."));
      return true;
    }
  }

  if (payload == "STOP" || payload == "CANCEL") {
    if (isStopwatch) {
      // Stopwatch: STOP = PAUSE (keeps the time frozen; use CLEAR to reset)
      if (!timerPaused) {
        timerPaused = true;
        timerRemainingAtPause = millis() - timerEndTime;
      }
      Serial.println(F("[STOPWATCH] Paused. Use CLEAR to reset to zero."));
    } else {
      // Countdown timer / Pomodoro: STOP = fully stop and return to Clock
      timerActive = false;
      timerFinished = false;
      timerPaused = false;
      isStopwatch = false;
      displayMode = 0;
      prevDisplayMode = 6;
      clockScrollDone = false;
      forceMessageRestart = true;
      lastSwitch = millis();
      Serial.println(F("[TIMER] Stopped. Returning to Clock."));
    }
    return true;
  }

  if (payload == "RESET") {
    if (isStopwatch) {
      timerPaused = true;
      timerRemainingAtPause = 0;
      timerFinished = false;
      timerEndTime = millis();  // zero elapsed time
      displayMode = 7;
      allowInterrupt = true;
      lastSwitch = millis();
      forceMessageRestart = true;
      Serial.println(F("[STOPWATCH] Reset."));
      return true;
    }
    return false;
  }

  if (payload == "CLEAR") {
    bool wasStopwatch = isStopwatch;
    timerActive = false;
    timerPaused = false;
    timerFinished = false;
    isStopwatch = false;
    displayMode = 0;
    prevDisplayMode = 6;
    clockScrollDone = false;
    forceMessageRestart = true;
    lastSwitch = millis();
    Serial.println(wasStopwatch ? F("[STOPWATCH] Cleared. Returning to Clock.") : F("[TIMER] Cleared. Returning to Clock."));
    return true;
  }

  if (payload == "PAUSE") {
    if (timerActive && !timerPaused && !timerFinished) {
      timerPaused = true;
      timerRemainingAtPause = isStopwatch ? (millis() - timerEndTime) : (timerEndTime - millis());
    }
    return true;
  }

  if (payload == "RESUME" || payload == "START") {
    if (timerActive && timerPaused) {
      timerEndTime = isStopwatch ? millis() - timerRemainingAtPause   // rewind start time
                                 : millis() + timerRemainingAtPause;  // existing countdown logic
      timerPaused = false;
    }
    return true;
  }

  if (payload == "RESTART") {
    if (timerOriginalDuration > 0) {
      isStopwatch = false;
      timerEndTime = millis() + timerOriginalDuration;
      timerActive = true;
      timerPaused = false;
      timerFinished = false;
      displayMode = 7;
      allowInterrupt = true;
      timerSubState = 0;
      lastSwitch = millis();
      forceMessageRestart = true;
      return true;
    }
    return false;
  }

  if (payload == "STOPWATCH") {

    // Already running -> Pause
    if (timerActive && isStopwatch && !timerPaused) {
      timerPaused = true;
      timerRemainingAtPause = millis() - timerEndTime;
      return true;
    }

    // Already paused -> Resume
    if (timerActive && isStopwatch && timerPaused) {
      timerEndTime = millis() - timerRemainingAtPause;
      timerPaused = false;
      return true;
    }

    // Not active -> Start a new stopwatch
    isStopwatch = true;
    isPomodoroActive = false;
    pomodoroInBreak = false;
    timerActive = true;
    timerPaused = false;
    timerFinished = false;
    timerEndTime = millis();
    timerSubState = 0;
    displayMode = 7;
    allowInterrupt = true;
    lastSwitch = millis();
    forceMessageRestart = true;
    return true;
  }

  long totalMs = 0;
  String val = "";
  for (unsigned int i = 0; i < payload.length(); i++) {
    char c = payload.charAt(i);
    if (isDigit(c)) val += c;
    else {
      long num = val.toInt();
      if (c == 'H') totalMs += num * 3600000;
      else if (c == 'M') totalMs += num * 60000;
      else if (c == 'S') totalMs += num * 1000;
      val = "";
    }
  }
  if (val.length() > 0 && totalMs == 0) totalMs = val.toInt() * 60000;

