obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
  if (totalMs > 86400000) totalMs = 86400000;  // 24h Cap

  if (totalMs > 0) {
    isStopwatch = false;
    timerOriginalDuration = totalMs;
    timerEndTime = millis() + totalMs;
    isPomodoroActive = false;
    pomodoroInBreak = false;
    timerActive = true;
    timerPaused = false;
    timerFinished = false;
    timerSubState = 0;
    displayMode = 7;
    allowInterrupt = true;
    lastSwitch = millis();
    forceMessageRestart = true;
    return true;
  }
  return false;
}

//Actions handler
void executeAction(const String &action, const String &value) {
  if (value.length() > 0) {
    Serial.println("[ACTION] " + action + " = " + value);
  } else {
    Serial.println("[ACTION] " + action);
  }
  String v = value;
  v.trim();
  v.toLowerCase();
  bool hasValue = v.length() > 0;
  bool boolVal = (v == "1" || v == "true" || v == "on");

  // Display actions
  if (action == "next_mode") {
    advanceDisplayMode(true);

  } else if (action == "prev_mode") {
    previousDisplayMode(true);

  } else if (action == "brightness") {
    handleBrightnessChange(value.toInt(), false);

  } else if (action == "brightness_up") {
    handleBrightnessChange(displayOff ? lastBrightnessBeforeOff : constrain(brightness + 1, 0, 15), false);

  } else if (action == "brightness_down") {
    if (!displayOff) { handleBrightnessChange(constrain(brightness - 1, 0, 15), false); }

  } else if (action == "display_off") {
    handleBrightnessChange(-1, false);

  } else if (action == "display_on") {
    handleBrightnessChange(lastBrightnessBeforeOff, false);

  } else if (action == "flip" || action == "flip_display") {
    flipDisplay = hasValue ? boolVal : !flipDisplay;
    P.setZoneEffect(0, flipDisplay, PA_FLIP_UD);
    P.setZoneEffect(0, flipDisplay, PA_FLIP_LR);

  } else if (action == "twelvehour" || action == "twelve_hour") {
    twelveHourToggle = hasValue ? boolVal : !twelveHourToggle;
    if (!hasValue && displayMode != 0) { goToMode("0"); }

  } else if (action == "dayofweek" || action == "show_dayofweek") {
    showDayOfWeek = hasValue ? boolVal : !showDayOfWeek;
    if (!hasValue && displayMode != 0) { goToMode("0"); }

  } else if (action == "showdate" || action == "show_date") {
    bool newVal = hasValue ? boolVal : !showDate;
    if (showDate && !newVal && displayMode == 5) { advanceDisplayMode(true); }
    showDate = newVal;
    if (!hasValue && showDate) { goToMode("5"); }

  } else if (action == "colon_blink" || action == "animated_seconds") {
    colonBlinkEnabled = hasValue ? boolVal : !colonBlinkEnabled;
    if (!hasValue && displayMode != 0) { goToMode("0"); }

  } else if (action == "humidity" || action == "show_humidity") {
    showHumidity = hasValue ? boolVal : !showHumidity;
    if (!hasValue) { goToMode("1"); }  // show the change on weather

  } else if (action == "weatherdesc" || action == "show_weather_desc") {
    bool newVal = hasValue ? boolVal : !showWeatherDescription;
    if (showWeatherDescription && !newVal && displayMode == 2) { advanceDisplayMode(true); }
    showWeatherDescription = newVal;
    if (!hasValue && showWeatherDescription) { goToMode("2"); }  // only jump when turning ON

  } else if (action == "units" || action == "imperial") {
    bool isImperial = (action == "imperial") ? (!hasValue ? true : boolVal) : (hasValue ? boolVal : strcmp(weatherUnits, "imperial") != 0);
    if (isImperial) {
      strcpy(weatherUnits, "imperial");
      tempSymbol = '\007';
    } else {
      strcpy(weatherUnits, "metric");
      tempSymbol = '\006';
    }
    networkData.requestWeatherRefresh();
    if (!hasValue) { goToMode("1"); }  // show the change on weather

  } else if (action == "metric") {
    strcpy(weatherUnits, "metric");
    tempSymbol = '\006';
    networkData.requestWeatherRefresh();
    if (!hasValue) { goToMode("1"); }  // show the change on weather

  } else if (action == "countdown_enabled" || action == "countdown") {
    bool newVal = hasValue ? boolVal : !countdownEnabled;
    if (countdownEnabled && !newVal && displayMode == 3) { advanceDisplayMode(true); }
    countdownEnabled = newVal;

  } else if (action == "dramatic_countdown") {
    bool newVal = hasValue ? boolVal : !isDramaticCountdown;
    if (isDramaticCountdown != newVal) {
      isDramaticCountdown = newVal;
      saveCountdownConfig(countdownEnabled, countdownTargetTimestamp, countdownLabel);
    }

  } else if (action == "clock_only_dimming") {
    clockOnlyDuringDimming = hasValue ? boolVal : !clockOnlyDuringDimming;
    configDirty = true;

  } else if (action == "go_to_mode") {
    goToMode(value);

  } else if (action == "enable_rotation") {
    rotationEnabled = hasValue ? boolVal : !rotationEnabled;
    if (rotationEnabled) advanceDisplayMode();

  }

  // Timer commands
  else if (action == "timer_stop" || action == "timer_cancel") {
    handleTimerCommand("[TIMER STOP]");
  } else if (action == "timer_pause") {
    handleTimerCommand("[TIMER PAUSE]");
  } else if (action == "timer_resume" || action == "timer_start") {
    handleTimerCommand("[TIMER RESUME]");
  } else if (action == "timer_restart") {
    if (!(clockOnlyDuringDimming && dimActive)) handleTimerCommand("[TIMER RESTART]");
  } else if (action == "timer") {
    if (!(clockOnlyDuringDimming && dimActive)) handleTimerCommand("[TIMER " + value + "]");
  } else if (action == "stopwatch" || action == "stopwatch_start") {
    if (!(clockOnlyDuringDimming && dimActive))
      handleTimerCommand("[STOPWATCH]");
  } else if (action == "stopwatch_pause") {
    handleTimerCommand("[STOPWATCH PAUSE]");
  } else if (action == "stopwatch_resume") {
    handleTimerCommand("[STOPWATCH RESUME]");
  } else if (action == "stopwatch_stop" || action == "stopwatch_cancel") {
    handleTimerCommand("[STOPWATCH STOP]");
  } else if (action == "stopwatch_restart") {
    if (!(clockOnlyDuringDimming && dimActive))
      handleTimerCommand("[STOPWATCH RESTART]");
  } else if (action == "stopwatch_reset") {
    handleTimerCommand("[STOPWATCH RESET]");
  } else if (action == "stopwatch_clear") {
    handleTimerCommand("[STOPWATCH CLEAR]");
  } else if (action == "pomodoro_start" || action == "pom") {
    if (!(clockOnlyDuringDimming && dimActive)) handlePomodoroCommand("[POMODORO]");
  } else if (action == "pomodoro") {
    if (!(clockOnlyDuringDimming && dimActive)) handlePomodoroCommand("[POMODORO " + value + "]");
  } else if (action == "pomodoro_stop") {
    handlePomodoroCommand("[POMODORO STOP]");
  } else if (action == "pomodoro_restart") {
    if (!(clockOnlyDuringDimming && dimActive)) handlePomodoroCommand("[POMODORO RESTART]");
  } else if (action == "pomodoro_pause") {
    handleTimerCommand("[TIMER PAUSE]");
  } else if (action == "pomodoro_resume") {
    handleTimerCommand("[TIMER RESUME]");

  } else if (action == "restart") {
    otaState.restartPending = true;
    otaState.restartRequestedAt = millis();

