obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
  } else if (action == "save") {
    configDirty = true;

  } else if (action == "language") {
    String lang = value;
    lang.trim();
    lang.toLowerCase();
    strlcpy(language, lang.c_str(), sizeof(language));
    networkData.requestWeatherRefresh();
    advanceDisplayMode();

  } else if (action == "clear_message") {
    allowInterrupt = true;
    forceMessageRestart = true;
    customMessage[0] = '\0';
    messageStartTime = 0;
    currentScrollCount = 0;
    messageDisplaySeconds = 0;
    messageScrollTimes = 0;

    if (strlen(lastPersistentMessage) > 0) {
      strlcpy(customMessage, lastPersistentMessage, sizeof(customMessage));
      messageScrollSpeed = GENERAL_SCROLL_SPEED;
      displayMode = 6;
      prevDisplayMode = 0;
      Serial.println(F("[MESSAGE] clear_message: restored persistent message"));
    } else {
      displayMode = 0;
      prevDisplayMode = 6;
      clockScrollDone = false;
      Serial.println(F("[MESSAGE] clear_message: no persistent message, returning to clock"));
    }

  } else {
    Serial.println("[ACTION] Unknown action: " + action);
  }
}

void handleBrightnessChange(int newBrightness, bool isFromUI) {
  // --- CASE 1: Turn Display OFF ---
  if (newBrightness == -1) {
    if (!displayOff) {
      if (brightness >= 0) lastBrightnessBeforeOff = brightness;
      P.displayShutdown(true);
      P.displayClear();
      displayOff = true;
      brightness = -1;
      configDirty = true;
      lastBrightnessChange = millis();
      Serial.printf("[BRIGHTNESS] Display turned OFF via %s\n", isFromUI ? "UI" : "API");
    }
    return;
  }

  // --- CASE 2: Turn Display ON or Adjust ---
  newBrightness = constrain(newBrightness, 0, 15);

  if (newBrightness != brightness || displayOff) {
    bool wakingUp = displayOff;
    brightness = newBrightness;
    configDirty = true;
    lastBrightnessChange = millis();
    P.setIntensity(brightness);

    if (wakingUp) {
      advanceDisplayMode(true);
      P.displayShutdown(false);
      P.displayClear();
      displayOff = false;
      Serial.printf("[BRIGHTNESS] Display woke from OFF via %s to %d\n", isFromUI ? "UI" : "API", brightness);
    } else {
      Serial.printf("[BRIGHTNESS] Intensity set to %d via %s\n", brightness, isFromUI ? "UI" : "API");
    }
  }
}

void goToMode(const String &target) {
  int targetMode = -1;
  String v = target;
  v.toLowerCase();

  if (v == "0" || v == "clock") targetMode = 0;
  else if (v == "1" || v == "weather") targetMode = 1;
  else if (v == "2" || v == "weather_desc") targetMode = 2;
  else if (v == "3" || v == "countdown") targetMode = 3;
  else if (v == "4" || v == "nightscout" || v == "bridge") targetMode = 4;
  else if (v == "5" || v == "date") targetMode = 5;
  else if (v == "6" || v == "message") targetMode = 6;
  else if (v == "7" || v == "timer") targetMode = 7;

  if (targetMode == -1 || !isModeAvailable(targetMode)) {
    Serial.printf("[DISPLAY] go_to_mode: invalid or unavailable target '%s'\n", target.c_str());
    return;
  }

  // ---- CLEANUP CURRENT MODE ----
  if (displayMode == 3) {
    countdownSegment = 0;
    segmentStartTime = 0;
    countdownShowFinishedMessage = false;
    hourglassPlayed = false;
  }

  prevDisplayMode = displayMode;  // general line already there
  displayMode = targetMode;

  // ---- RESET TARGET MODE STATE ----
  if (targetMode == 0) {
    prevDisplayMode = 6;
    clockScrollDone = false;
    P.displayReset();
    P.displayClear();
    delay(100);
  }

  if (displayMode == 6 || displayMode == 2 || displayMode == 3) {
    P.displayReset();
    P.displayClear();
  }

  // ---- RESET TARGET MODE STATE ----
  if (targetMode == 3) {
    countdownSegment = 0;
    segmentStartTime = 0;
    countdownShowFinishedMessage = false;
    hourglassPlayed = false;
  }

  // ---- SYNC modeIndex ----
  for (int i = 0; i < MODE_COUNT; i++) {
    if (modeOrder[i] == displayMode) {
      modeIndex = i;
      break;
    }
  }

  // ---- RESET SCROLL STATE ----
  clockScrollDone = false;
  descScrolling = false;
  descScrollEndTime = 0;

  const char *modeNames[] = { "CLOCK", "WEATHER", "WEATHER DESC", "COUNTDOWN", "BRIDGE", "DATE", "CUSTOM MESSAGE", "TIMER" };
  Serial.printf("[DISPLAY] go_to_mode: %s (from %s)\n", modeNames[targetMode], modeNames[prevDisplayMode]);
  lastSwitch = millis();
}


void setupButtons() {
  for (int i = 0; i < 4; i++) {
    if (btnCfg[i].pin >= 0) {
      pinMode(btnCfg[i].pin, INPUT_PULLUP);
      Serial.printf("[BUTTON] Button %d ready on GPIO %d\n", i + 1, btnCfg[i].pin);
    }
  }
}

void handleButtons() {
  static unsigned long lastPress[4] = { 0, 0, 0, 0 };
  static unsigned long pressStart[4] = { 0, 0, 0, 0 };
  static bool lastState[4] = { HIGH, HIGH, HIGH, HIGH };
  static bool longFired[4] = { false, false, false, false };

  for (int i = 0; i < 4; i++) {
    if (btnCfg[i].pin < 0) continue;
    bool cur = digitalRead(btnCfg[i].pin);

    if (cur == LOW && lastState[i] == HIGH) {  // press down
      pressStart[i] = millis();
      longFired[i] = false;
    }
    if (cur == LOW && !longFired[i]) {  // held
      if (millis() - pressStart[i] >= BTN_LONG_MS) {
        longFired[i] = true;
        if (btnCfg[i].longAct.length() > 0) {
          Serial.printf("[BUTTON] Button %d LONG → %s\n", i + 1, btnCfg[i].longAct.c_str());
          executeAction(btnCfg[i].longAct, "");
        }
      }
    }
    if (cur == HIGH && lastState[i] == LOW) {  // release
      if (!longFired[i] && millis() - lastPress[i] > 200) {
        lastPress[i] = millis();
        if (btnCfg[i].shortAct.length() > 0) {
          Serial.printf("[BUTTON] Button %d SHORT → %s\n", i + 1, btnCfg[i].shortAct.c_str());
          executeAction(btnCfg[i].shortAct, "");
        }
      }
    }
    lastState[i] = cur;
  }
}


// -----------------------------------------------------------------------------
// Main setup() and loop()
// -----------------------------------------------------------------------------
/*
DisplayMode key:
  0: Clock
  1: Weather
  2: Weather Description
  3: Countdown
  4: Bridge
  5: Date
  6: Custom Message
*/
void setup() {
  // pinMode(BUTTON_PIN, INPUT_PULLUP);  // ← Uncomment if using button

