obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
  Serial.begin(115200);
  delay(1000);
  esp_log_level_set("esp_littlefs", ESP_LOG_NONE);
  Serial.println();
  Serial.println(F("[SETUP] Starting setup..."));
#if defined(ARDUINO_USB_MODE) || defined(USB_SERIAL)
  Serial.setTxTimeoutMs(50);
  Serial.println(F("[SERIAL] USB CDC detected — TX timeout enabled"));
  delay(500);
#endif
  Serial.println(F("[FS] Mounting LittleFS (auto-format enabled)..."));
  if (!LittleFS.begin(true)) {
    Serial.println(F("[ERROR] LittleFS mount failed even after format. Halting."));
    while (true) {
      delay(1000);
      yield();
    }
  }
  Serial.println(F("[FS] LittleFS mounted and ready."));
  loadUptime();
  const PinConfig pins = loadPinConfig({ L_CLK, L_CS, L_DATA });
  CLK_PIN = pins.clock;
  CS_PIN = pins.chipSelect;
  DATA_PIN = pins.data;
  new (&P) MD_Parola(HARDWARE_TYPE, DATA_PIN, CLK_PIN, CS_PIN, MAX_DEVICES);
  P.begin();
  P.setCharSpacing(0);
  P.setFont(mFactory);
  loadConfig();
  WeatherData initialWeather;
  initialWeather.available = weatherAvailable;
  initialWeather.fetched = weatherFetched;
  initialWeather.temperature = currentTemp;
  initialWeather.mainDescription = mainDesc;
  initialWeather.detailedDescription = detailedDesc;
  initialWeather.icon = weatherIcon;
  initialWeather.humidity = currentHumidity;
  initialWeather.sunriseHour = sunriseHour;
  initialWeather.sunriseMinute = sunriseMinute;
  initialWeather.sunsetHour = sunsetHour;
  initialWeather.sunsetMinute = sunsetMinute;
  networkData.initialize(initialWeather);
  setupButtons();
  P.setIntensity(brightness);
  if (displayOff) {
    P.displayShutdown(true);
    Serial.println(F("[SETUP] Display restored as OFF"));
  } else {
    P.displayShutdown(false);
  }
  P.setZoneEffect(0, flipDisplay, PA_FLIP_UD);
  P.setZoneEffect(0, flipDisplay, PA_FLIP_LR);

  Serial.println(F("[SETUP] Parola (LED Matrix) initialized"));

#if defined(ESP32)
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(false);
  WiFi.persistent(false);

  WiFi.onEvent([](WiFiEvent_t event, WiFiEventInfo_t info) {
    const char *name = nullptr;
    switch (event) {
      case ARDUINO_EVENT_WIFI_STA_GOT_IP:
        name = "GOT_IP";
        lastWifiConnectTime = millis();
        Serial.println("[WIFI EVENT] Re-initializing mDNS due to new IP.");
        setupMDNS();
        break;
      case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
        name = "DISCONNECTED";
        MDNS.end();
        Serial.println("[WIFI EVENT] mDNS stopped.");
        break;
      default: return;  // ignore all other events
    }
    Serial.printf("[WIFI EVENT] %s (%d)\n", name, event);
  });

#elif defined(ESP8266)
  WiFi.setAutoReconnect(false);
  WiFi.persistent(false);
  mConnectHandler = WiFi.onStationModeConnected([](const WiFiEventStationModeConnected &ev) {
    Serial.println("[WIFI EVENT] Connected");
  });
  mDisConnectHandler = WiFi.onStationModeDisconnected([](const WiFiEventStationModeDisconnected &ev) {
    if (isRebooting) {
      Serial.println(F("[WIFI] Disconnect ignored during reboot."));
      return;
    }
    Serial.printf("[WIFI EVENT] Disconnected (Reason: %d)\n", ev.reason);
    MDNS.end();
  });
  mGotIpHandler = WiFi.onStationModeGotIP([](const WiFiEventStationModeGotIP &ev) {
    Serial.printf("[WIFI EVENT] GOT_IP - IP: %s\n", ev.ip.toString().c_str());
    lastWifiConnectTime = millis();
    setupMDNS();
  });
#endif
  connectWiFi();
  if (isAPMode) {
    Serial.println(F("[SETUP] WiFi connection failed. Device is in AP Mode."));
  } else if (WiFi.status() == WL_CONNECTED) {
    Serial.println(F("[SETUP] WiFi connected successfully to local network."));
  } else {
    Serial.println(F("[SETUP] WiFi state is uncertain after connection attempt."));
  }
  if (!isAPMode && WiFi.status() == WL_CONNECTED) {
    setupMDNS();
  }
  setupWebServer();
  Serial.println(F("[SETUP] Webserver setup complete"));
  Serial.println(F("[SETUP] Setup complete"));
  Serial.println();
  setupTime();
#if !defined(ARDUINO_USB_MODE)
  printConfigToSerial();
#endif
  displayMode = 0;
  lastSwitch = millis() - (clockDuration - 500);
  lastColonBlink = millis();
  resetUptimeSession();
  saveUptime();
}

void advanceDisplayMode(bool forced) {
  if (!rotationEnabled && !forced) return;
  // Sync modeIndex to current displayMode position before going backwards
  for (int i = 0; i < MODE_COUNT; i++) {
    if (modeOrder[i] == displayMode) {
      modeIndex = i;
      break;
    }
  }
  // ---- DIMMING LOCK ----
  if (clockOnlyDuringDimming && dimActive) {
    if (displayMode != 0) {
      displayMode = 0;
      Serial.println(F("[DISPLAY] Dimming lock: Forcing Mode 0"));
    }
    return;
  }

  if (clockOnlyDuringDimming) {
    time_t now = time(nullptr);
    struct tm local_tm;
    localtime_r(&now, &local_tm);
    int curTotal = local_tm.tm_hour * 60 + local_tm.tm_min;
    int startTotal = -1, endTotal = -1;
    bool currentlyDimmed = false;

    if (autoDimmingEnabled) {
      startTotal = sunsetHour * 60 + sunsetMinute;
      endTotal = sunriseHour * 60 + sunriseMinute;
      currentlyDimmed = (startTotal < endTotal)
                          ? (curTotal >= startTotal && curTotal < endTotal)
                          : (curTotal >= startTotal || curTotal < endTotal);
    } else if (dimmingEnabled) {
      startTotal = dimStartHour * 60 + dimStartMinute;
      endTotal = dimEndHour * 60 + dimEndMinute;
      currentlyDimmed = (startTotal < endTotal)
                          ? (curTotal >= startTotal && curTotal < endTotal)
                          : (curTotal >= startTotal || curTotal < endTotal);
    }

    if (currentlyDimmed) {
      displayMode = 0;
      lastSwitch = millis();
      Serial.println(F("[DISPLAY] Staying in CLOCK (dimming active)"));
      return;
    }
  }

  // ---- RESET COUNTDOWN STATE WHEN LEAVING ----
  if (displayMode == 3) {
    countdownSegment = 0;
    segmentStartTime = 0;
  }

  prevDisplayMode = displayMode;

  // ---- SAFE ROTATION ENGINE ----
  for (int i = 0; i < MODE_COUNT; i++) {
    modeIndex++;
    if (modeIndex >= MODE_COUNT)
      modeIndex = 0;

    int nextMode = modeOrder[modeIndex];

    // --- Bridge mode throttle (YouTube, Nightscout, and RSS) ---
    if (nextMode == 4) {
      BRIDGE_SHOW_EVERY = parseBridgeShowEvery(String(ntpServer2));
      if (bridgeRotationCount % BRIDGE_SHOW_EVERY != 0) {
        bridgeRotationCount++;
        continue;
      }
      bridgeRotationCount++;
    }

    if (isModeAvailable(nextMode)) {
      if (displayMode == 6 || displayMode == 2 || displayMode == 3) {
        // P.displayReset();
        // P.displayClear();
      }

      displayMode = nextMode;

      const char *modeNames[] = { "CLOCK", "WEATHER", "WEATHER DESC", "COUNTDOWN", "BRIDGE", "DATE", "CUSTOM MESSAGE", "TIMER" };
      const char *newName = displayMode < 8 ? modeNames[displayMode] : "UNKNOWN";
      const char *prevName = prevDisplayMode < 8 ? modeNames[prevDisplayMode] : "UNKNOWN";
      Serial.printf("[DISPLAY] Switching to display mode: %s (from %s)\n", newName, prevName);

      clockScrollDone = false;
      descScrolling = false;
      descScrollEndTime = 0;
      lastSwitch = millis();
      return;
    }
  }

  // ---- FALLBACK ----
  displayMode = 0;
  Serial.println(F("[DISPLAY] Fallback to CLOCK"));
}

void previousDisplayMode(bool forced) {
  if (!rotationEnabled && !forced) return;
  // Sync modeIndex to current displayMode position before going backwards
  for (int i = 0; i < MODE_COUNT; i++) {
    if (modeOrder[i] == displayMode) {
      modeIndex = i;
      break;
    }
  }
  if (clockOnlyDuringDimming && dimActive) {
    displayMode = 0;
    return;
  }

  if (displayMode == 3) {
    countdownSegment = 0;
    segmentStartTime = 0;
  }

  prevDisplayMode = displayMode;

  for (int i = 0; i < MODE_COUNT; i++) {
    if (modeIndex == 0)
      modeIndex = MODE_COUNT - 1;
    else
      modeIndex--;

    int nextMode = modeOrder[modeIndex];

    if (isModeAvailable(nextMode)) {
      if (displayMode == 6 || displayMode == 2 || displayMode == 3) {
        P.displayReset();
        P.displayClear();
      }

      displayMode = nextMode;

      const char *modeNames[] = { "CLOCK", "WEATHER", "WEATHER DESC", "COUNTDOWN", "BRIDGE", "DATE", "CUSTOM MESSAGE", "TIMER" };
      const char *newName = displayMode < 8 ? modeNames[displayMode] : "UNKNOWN";
      const char *prevName = prevDisplayMode < 8 ? modeNames[prevDisplayMode] : "UNKNOWN";
      Serial.printf("[DISPLAY] Switching to display mode: %s (from %s)\n", newName, prevName);

      clockScrollDone = false;
      descScrolling = false;
      descScrollEndTime = 0;
      lastSwitch = millis();
      return;
    }
  }

  displayMode = 0;
  Serial.println(F("[DISPLAY] Fallback to CLOCK"));
}

