obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
bool isModeAvailable(int mode) {
  SnsType snsType = detectSnsType(String(ntpServer2));
  switch (mode) {
    case 0: return true;  // CLOCK always available
    case 1: return weatherAvailable && strlen(openWeatherApiKey) == 32 && strlen(openWeatherCity) > 0 && strlen(openWeatherCountry) > 0;
    case 2: return showWeatherDescription && weatherAvailable && weatherDescription.length() > 0;
    case 3: return countdownEnabled && !countdownFinished && ntpSyncSuccessful;
    case 4: return snsType != SNS_NTP;  // nightscout, youtube, or instagram all use mode 4
    case 5: return showDate;
    case 6: return strlen(customMessage) > 0;
  }
  return false;
}

//config save after countdown finishes
bool saveCountdownConfig(bool enabled, time_t targetTimestamp, const String &label) {
  JsonDocument doc;

  File configFile = LittleFS.open("/config.json", "r");
  if (configFile) {
    DeserializationError err = deserializeJson(doc, configFile);
    configFile.close();
    if (err) {
      Serial.print(F("[saveCountdownConfig] Error parsing config.json: "));
      Serial.println(err.f_str());
      return false;
    }
  }

  JsonObject countdownObj = doc["countdown"].to<JsonObject>();
  countdownObj["enabled"] = enabled;
  countdownObj["targetTimestamp"] = targetTimestamp;
  countdownObj["label"] = label;
  countdownObj["isDramaticCountdown"] = isDramaticCountdown;
  doc.remove("countdownEnabled");
  doc.remove("countdownDate");
  doc.remove("countdownTime");
  doc.remove("countdownLabel");

  if (LittleFS.exists("/config.json")) {
    LittleFS.rename("/config.json", "/config.bak");
  }

  File f = LittleFS.open("/config.json", "w");
  if (!f) {
    Serial.println(F("[saveCountdownConfig] ERROR: Cannot write to /config.json"));
    return false;
  }

  size_t bytesWritten = serializeJson(doc, f);
  f.close();

  Serial.printf("[saveCountdownConfig] Config updated. %u bytes written.\n", bytesWritten);
  return true;
}

bool saveConfigRuntime() {

  JsonDocument doc;

  File configFile = LittleFS.open("/config.json", "r");
  if (!configFile) {
    Serial.println(F("[CONFIG] Failed to open config for reading"));
    return false;
  }

  DeserializationError err = deserializeJson(doc, configFile);
  configFile.close();

  if (err) {
    Serial.print(F("[CONFIG] JSON parse error: "));
    Serial.println(err.f_str());
    return false;
  }

  // Update only runtime-changing fields
  doc["brightness"] = brightness;
  doc["displayOff"] = displayOff;
  doc["lastBrightnessBeforeOff"] = lastBrightnessBeforeOff;
  doc["flipDisplay"] = flipDisplay;
  doc["twelveHourToggle"] = twelveHourToggle;
  doc["showDayOfWeek"] = showDayOfWeek;
  doc["showDate"] = showDate;
  doc["showHumidity"] = showHumidity;
  doc["colonBlinkEnabled"] = colonBlinkEnabled;
  doc["clockOnlyDuringDimming"] = clockOnlyDuringDimming;

  File configFileWrite = LittleFS.open("/config.json", "w");
  if (!configFileWrite) {
    Serial.println(F("[CONFIG] Failed to open config for writing"));
    return false;
  }

  serializeJsonPretty(doc, configFileWrite);
  configFileWrite.close();

  Serial.println(F("[CONFIG] Runtime config saved"));
  return true;
}

//Custom font format for days
String getFormattedDateText(const char *rawText) {
  String input = String(rawText);
  String output = "";

  // 1. Detect if it's Japanese/Multi-byte
  bool isMultiByte = false;
  for (int i = 0; i < input.length(); i++) {
    if ((uint8_t)input[i] > 127) {
      isMultiByte = true;
      break;
    }
  }

  if (isMultiByte) {
    // Keep Japanese symbols as they are (e.g., "³")
    output = input;
  } else {
    // Determine the separator: \016 for custom, " " for standard
    String separator = useCustomFont ? "\016" : " ";

    // If standard font, convert to uppercase first (e.g., "tue" -> "TUE")
    if (!useCustomFont) {
      input.toUpperCase();
    }

    // 2. Inject the separator between characters
    for (int i = 0; i < input.length(); i++) {
      output += input[i];
      if (i < input.length() - 1) {
        output += separator;
      }
    }
  }

  // 3. Add the trailing spaces (M\016O\016N   or T U E  )
  output += "  ";
  return output;
}


void loop() {
  handleButtons();

  // --- WIFI RECONNECTION ---
  static unsigned long lastReconnectAttempt = 0;
  static unsigned long reconnectInterval = 5000;
  static bool wasConnected = true;

  if (!isRebooting) {
    if (WiFi.status() != WL_CONNECTED) {
      if (wasConnected) {
        Serial.println(F("[WIFI] Connection lost. Will attempt reconnection..."));
        wasConnected = false;
        reconnectInterval = 5000;
      }

      if (millis() - lastReconnectAttempt > reconnectInterval) {
        lastReconnectAttempt = millis();

        Serial.printf(
          "[WIFI] Reconnecting... (next attempt in %lus)\n",
          min(reconnectInterval * 2, 300000UL) / 1000);

        WiFi.disconnect();
        delay(100);

#ifdef ESP8266
        WiFi.begin(ssid, password);
#else
        WiFi.reconnect();
#endif

        reconnectInterval = min(reconnectInterval * 2, 300000UL);
      }
    } else if (!wasConnected) {
      Serial.println(F("[WIFI] Reconnected!"));
      wasConnected = true;
      reconnectInterval = 5000;
    }
  }

  if (timerActive && (displayMode != 7 && displayMode != 6)) {
    if (!(clockOnlyDuringDimming && dimActive)) {
      displayMode = 7;
      timerSubState = 0;
      lastSwitch = millis();
      forceMessageRestart = true;
    }
  }
  // 1. REBOOT HANDLER: Execute the restart outside of the Async callback
  if (otaState.restartPending && (millis() - otaState.restartRequestedAt > 2000)) {
    Serial.println(F("[SYSTEM] Rebooting now..."));
    ESP.restart();
  }
  // 2. OTA LOCK: If updating, yield to WiFi and stop everything else
  if (otaState.updating) {
    yield();
    return;
  }
  if (isAPMode) {
    dnsServer.processNextRequest();
    if (credentialsExist()) {
      static unsigned long apStartTime = 0;
      if (apStartTime == 0) apStartTime = millis();  // Mark the start time once

      // 3 Minutes = 180000 ms
      if (millis() - apStartTime > 180000) {
        Serial.println(F("[WIFI] AP Timeout: Saved credentials found. Rebooting to retry connection..."));
        delay(500);
        ESP.restart();
      }
    }
    // AP Mode animation
    static unsigned long apAnimTimer = 0;
    static int apAnimFrame = 0;
    unsigned long now = millis();
    if (now - apAnimTimer > 750) {
      apAnimTimer = now;
      apAnimFrame++;
    }
    P.setTextAlignment(PA_CENTER);
    switch (apAnimFrame % 3) {
      case 0:
        {
          char buf[] = { 5, ' ', (char)169, '\0' };
          P.print(buf);
          break;
        }
      case 1:
        {
          char buf[] = { 5, ' ', (char)170, '\0' };
          P.print(buf);
          break;
        }
      case 2:
        {
          char buf[] = { 5, ' ', (char)171, '\0' };
          P.print(buf);
          break;
        }
    }
    yield();
    return;
  }

