obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
      if (millis() - lastNtpRetryAttempt > ntpRetryInterval) {
        lastNtpRetryAttempt = millis();
        ntpRetryCount = 0;
        ntpStartTime = millis();
        ntpState = NTP_SYNCING;
        Serial.println(F("[TIME] Retrying NTP sync..."));

        firstRetry = false;
      }
      break;
  }


  // Only advance mode by timer for clock/weather, not description!
  unsigned long displayDuration = (displayMode == 0) ? clockDuration : weatherDuration;
  if (rotationEnabled && (displayMode == 0 || displayMode == 1) && millis() - lastSwitch > displayDuration) {
    advanceDisplayMode();
  }


  // --- OUTBOUND DATA SERVICES ---
  static WeatherRequest weatherRequest;
  if (weatherRequest.apiKey != openWeatherApiKey ||
      weatherRequest.city != openWeatherCity ||
      weatherRequest.country != openWeatherCountry ||
      weatherRequest.units != weatherUnits ||
      weatherRequest.language != language) {
    weatherRequest.apiKey = openWeatherApiKey;
    weatherRequest.city = openWeatherCity;
    weatherRequest.country = openWeatherCountry;
    weatherRequest.units = weatherUnits;
    weatherRequest.language = language;
  }
  static String snsSource;
  if (snsSource != ntpServer2) snsSource = ntpServer2;
  networkData.configure(weatherRequest, snsSource);
  networkData.update(WiFi.status() == WL_CONNECTED, ntpSyncSuccessful, lastWifiConnectTime);

  if (networkData.takeWeatherUpdate()) {
    const WeatherData &weather = networkData.weather();
    weatherAvailable = weather.available;
    weatherFetched = weather.fetched;
    if (weather.fetched) {
      currentTemp = weather.temperature;
      currentHumidity = weather.humidity;
      mainDesc = weather.mainDescription;
      detailedDesc = weather.detailedDescription;
      weatherIcon = weather.icon;
      weatherDescription = weatherIcon + " " + cleanTextForDisplay(detailedDesc);
      sunriseHour = weather.sunriseHour;
      sunriseMinute = weather.sunriseMinute;
      sunsetHour = weather.sunsetHour;
      sunsetMinute = weather.sunsetMinute;
      Serial.printf("[WEATHER] Description used: %s\n", weatherDescription.c_str());
      if (autoDimmingEnabled && sunriseHour >= 0 && sunsetHour >= 0) {
        saveSunriseSunsetToConfig(sunriseHour, sunriseMinute, sunsetHour, sunsetMinute);
      }
    }
  }

  if (networkData.takeNightscoutUpdate()) {
    const NightscoutData &nightscout = networkData.nightscout();
    currentGlucose = nightscout.glucose;
    currentDirection = nightscout.direction;
    lastGlucoseTime = nightscout.readingTime;
    nightscoutMmol = nightscout.useMmol;
  }

  if (networkData.takeSnsUpdate()) {
    const SnsData &sns = networkData.sns();
    youtubeSubscribers = sns.youtubeSubscribers;
    instagramFollowers = sns.instagramFollowers;
    rssTitle = sns.rssTitle;
  }

  const char *const *daysOfTheWeek = getDaysOfWeek(language);
  // Call our new formatting function
  String daySymbol = getFormattedDateText(daysOfTheWeek[timeinfo.tm_wday]);


  // build base HH:MM first ---
  char baseTime[9];
  if (twelveHourToggle) {
    int hour12 = timeinfo.tm_hour % 12;
    if (hour12 == 0) hour12 = 12;
    sprintf(baseTime, "%d:%02d", hour12, timeinfo.tm_min);
  } else {
    sprintf(baseTime, "%02d:%02d", timeinfo.tm_hour, timeinfo.tm_min);
  }

  // add seconds only if colon blink enabled AND weekday hidden ---
  char timeWithSeconds[12];
  if (!showDayOfWeek && colonBlinkEnabled) {
    // Remove any leading space from baseTime
    const char *trimmedBase = baseTime;
    if (baseTime[0] == ' ') trimmedBase++;  // skip leading space
    sprintf(timeWithSeconds, "%s:%02d", trimmedBase, timeinfo.tm_sec);
  } else if (!showDayOfWeek && !colonBlinkEnabled) {
    sprintf(timeWithSeconds, "  %s  ", baseTime);
  } else {
    strcpy(timeWithSeconds, baseTime);  // no seconds
  }

  // keep spacing logic the same ---
  char timeSpacedStr[24];
  int j = 0;
  for (int i = 0; timeWithSeconds[i] != '\0'; i++) {
    timeSpacedStr[j++] = timeWithSeconds[i];
    if (timeWithSeconds[i + 1] != '\0') {
      timeSpacedStr[j++] = ' ';
    }
  }
  timeSpacedStr[j] = '\0';

  // build final string ---
  String formattedTime;
  if (showDayOfWeek) {
    // daySymbol now has either "t\016u\016e  " or "T U E  "
    // In both cases, the padding is already inside daySymbol.
    formattedTime = daySymbol + String(timeSpacedStr);
  } else {
    formattedTime = String(timeSpacedStr);
  }

  unsigned long currentDisplayDuration = 0;
  if (displayMode == 0) {
    currentDisplayDuration = clockDuration;
  } else if (displayMode == 1) {  // Weather
    currentDisplayDuration = weatherDuration;
  }

  // Only advance mode by timer for clock/weather static (Mode 0 & 1).
  // Other modes (2, 3) have their own internal timers/conditions for advancement.
  if (rotationEnabled && (displayMode == 0 || displayMode == 1) && (millis() - lastSwitch > currentDisplayDuration)) {
    advanceDisplayMode();
  }


  // --- CLOCK Display Mode ---
  if (displayMode == 0) {
    if (forceMessageRestart) {
      P.displayReset();
      P.displayClear();
      forceMessageRestart = false;
      clockScrollDone = false;  // Ensure it scrolls in
    }
    if (forceMessageRestart) return;
    P.setCharSpacing(0);

    // --- NTP SYNC ---
    if (ntpState == NTP_SYNCING) {
      P.setTextAlignment(PA_CENTER);
      if (ntpSyncSuccessful || ntpRetryCount >= maxNtpRetries || millis() - ntpStartTime > ntpTimeout) {
        ntpState = NTP_FAILED;
      } else if (millis() - ntpAnimTimer > 750) {
        if (forceMessageRestart) return;
        ntpAnimTimer = millis();
        switch (ntpAnimFrame % 3) {
          case 0:
            {
              String s = F("S Y N C ");
              s += char(174);
              P.print(s.c_str());
              break;
            }
          case 1:
            {
              String s = F("S Y N C ");
              s += char(175);
              P.print(s.c_str());
              break;
            }
          case 2:
            {
              String s = F("S Y N C ");
              s += char(186);
              P.print(s.c_str());
              break;
            }
        }
        ntpAnimFrame++;
      }
    }
    // --- NTP / WEATHER ERROR ---
    else if (!ntpSyncSuccessful) {
      if (forceMessageRestart) return;
      P.setTextAlignment(PA_CENTER);
      static unsigned long errorAltTimer = 0;
      static bool showNtpError = true;

      if (!ntpSyncSuccessful && !weatherAvailable) {
        if (millis() - errorAltTimer > 2000) {
          errorAltTimer = millis();
          showNtpError = !showNtpError;
        }
        if (showNtpError) {
          P.write(2);  // NTP error glyph
        } else {
          P.write(1);  // Weather error glyph
        }

      } else if (!ntpSyncSuccessful) {
        P.write(2);
      } else if (!weatherAvailable) {
        P.write(1);
      }
    }
    // --- DISPLAY CLOCK ---
    else {
      String timeString = formattedTime;
      if (showDayOfWeek && colonBlinkEnabled && !colonVisible) {
        timeString.replace(":", " ");
      }

      // --- SCROLL IN ONLY WHEN COMING FROM SPECIFIC MODES OR FIRST BOOT ---
      bool shouldScrollIn = false;
      if (prevDisplayMode == -1 || prevDisplayMode == 3 || prevDisplayMode == 4) {
        shouldScrollIn = true;  // first boot or other special modes
      } else if (prevDisplayMode == 2 && weatherDescription.length() > 8) {
        shouldScrollIn = true;  // only scroll in if weather was scrolling
      } else if (prevDisplayMode == 6) {
        shouldScrollIn = true;  // scroll in when coming from custom message
      }

      if (shouldScrollIn && !clockScrollDone) {
        textEffect_t inDir = getEffectiveScrollDirection(PA_SCROLL_LEFT, flipDisplay);

        P.displayText(
          timeString.c_str(),
          PA_CENTER,
          GENERAL_SCROLL_SPEED,
          0,
          inDir,
          PA_NO_EFFECT);
        while (!P.displayAnimate()) {
          if (displayMode != 0) {
            clockScrollDone = false;
            return;
          }
          if (forceMessageRestart) {
            clockScrollDone = false;
            return;
          }
          yield();
        }
        // Only if we finish the while loop naturally do we mark it done
        clockScrollDone = true;
      } else {
        P.setTextAlignment(PA_CENTER);
        P.print(timeString);
      }
    }

    yield();
  } else {
    // --- leaving clock mode ---
    if (prevDisplayMode == 0) {
      clockScrollDone = false;  // reset for next time we enter clock
    }
  }


  // --- WEATHER Display Mode ---
  static bool weatherWasAvailable = false;
  if (displayMode == 1) {
    if (forceMessageRestart) return;
    P.setCharSpacing(1);
    P.setTextAlignment(PA_CENTER);
    if (weatherAvailable) {
      String weatherDisplay;
      if (showHumidity && currentHumidity != -1) {
        int cappedHumidity = (currentHumidity > 99) ? 99 : currentHumidity;
        weatherDisplay = currentTemp + " " + String(cappedHumidity) + "%";
      } else {
        weatherDisplay = currentTemp + tempSymbol;
      }
      P.print(weatherDisplay.c_str());
      weatherWasAvailable = true;
    } else {
      if (weatherWasAvailable) {
        Serial.println(F("[DISPLAY] Weather not available, showing clock..."));
        weatherWasAvailable = false;
      }
      if (ntpSyncSuccessful) {
        String timeString = formattedTime;
        if (!colonVisible) timeString.replace(":", " ");
        P.setCharSpacing(0);
        P.print(timeString);
      } else {
        P.setCharSpacing(0);
        P.setTextAlignment(PA_CENTER);
        P.write(1);
      }
    }
    yield();
    return;
  }


  // --- WEATHER DESCRIPTION Display Mode ---
  if (displayMode == 2 && showWeatherDescription && weatherAvailable && weatherDescription.length() > 0) {
    P.setCharSpacing(1);
    P.setTextAlignment(PA_CENTER);
    if (forceMessageRestart) return;
    String desc = weatherDescription;

