obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
        // Format the full string
        char buf[50];
        // Only show days if there are any, otherwise start with hours
        if (days > 0) {
          sprintf(buf, "%s IN: %ldD %02ldH %02ldM %02ldS", label.c_str(), days, hours, minutes, seconds);
        } else {
          sprintf(buf, "%s IN: %02ldH %02ldM %02ldS", label.c_str(), hours, minutes, seconds);
        }

        String fullString = String(buf);
        bool addPadding = false;
        bool humidityVisible = showHumidity && weatherAvailable && strlen(openWeatherApiKey) == 32 && strlen(openWeatherCity) > 0 && strlen(openWeatherCountry) > 0;

        // Padding logic
        if (prevDisplayMode == 0 && (showDayOfWeek || colonBlinkEnabled)) {
          addPadding = true;
        } else if (prevDisplayMode == 1 && humidityVisible) {
          addPadding = true;
        }
        if (addPadding) {
          fullString = "    " + fullString;  // 4 spaces
        }

        // Display the full string and scroll it
        P.setTextAlignment(PA_LEFT);
        P.setCharSpacing(1);
        textEffect_t actualScrollDirection = getEffectiveScrollDirection(PA_SCROLL_LEFT, flipDisplay);
        P.displayScroll(fullString.c_str(), PA_LEFT, actualScrollDirection, GENERAL_SCROLL_SPEED);

        // Blocking loop to ensure the full message scrolls
        while (!P.displayAnimate()) {
          if (displayMode != 3) return;
          if (forceMessageRestart) break;
          yield();
        }

        // After scrolling is complete, we're done with this display mode
        // Move to the next mode and exit the function.
        P.setTextAlignment(PA_CENTER);
        advanceDisplayMode();
        yield();
        return;
      }
    }

    // Keep alignment reset just in case
    P.setTextAlignment(PA_CENTER);
    P.setCharSpacing(1);
    yield();
    return;
  }  // End of if (displayMode == 3 && ...)


  // --- BRIDGE Display Mode ---
  if (displayMode == 4) {
    if (forceMessageRestart) return;
    SnsType snsType = detectSnsType(String(ntpServer2));

    if (snsType == SNS_YOUTUBE || snsType == SNS_INSTAGRAM) {
      long count = (snsType == SNS_YOUTUBE) ? youtubeSubscribers : instagramFollowers;
      char icon = (snsType == SNS_YOUTUBE) ? 157 : 155;

      if (count < 0) {
        P.setTextAlignment(PA_CENTER);
        P.setCharSpacing(0);

        String displayText = "";
        displayText += icon;
        displayText += " - - ";

        P.print(displayText.c_str());

        unsigned long snsStart = millis();
        while (millis() - snsStart < weatherDuration) {
          if (displayMode != 4) return;
          if (forceMessageRestart) return;
          yield();
        }

        advanceDisplayMode();
        return;
      }

      String countStr;

      if (count < 10000) {
        countStr = String(count);
      } else if (count < 100000) {
        float v = count / 1000.0f;
        countStr = (v == (int)v) ? String((int)v) : String(v, 1);
        countStr += char(193);  // K
      } else if (count < 1000000) {
        countStr = String(count / 1000);
        countStr += char(193);  // K
      } else if (count < 100000000) {
        float v = count / 1000000.0f;
        countStr = (v == (int)v) ? String((int)v) : String(v, 1);
        countStr += char(192);  // M
      } else {
        countStr = String(count / 1000000);
        countStr += char(192);  // M
      }

      if (countStr.length() <= 5) {
        // --- STATIC: icon + up to 5 digits fits the 32px display ---
        P.setTextAlignment(PA_CENTER);
        P.setCharSpacing(0);  // explicit 2px gap below, not auto-spacing
        String iconStr = String(icon) + " ";
        // 1. Manually add a 1px space between each digit of the number
        String spacedCountStr = "";
        for (unsigned int i = 0; i < countStr.length(); i++) {
          spacedCountStr += countStr[i];
          if (i < countStr.length() - 1) {
            spacedCountStr += " ";  // Inject a 1px font space between digits
          }
        }
        String endpaddedCount = String(spacedCountStr) + " ";
        String displayText = String(iconStr) + " " + endpaddedCount;
        P.print(displayText.c_str());

        unsigned long snsStart = millis();
        while (millis() - snsStart < weatherDuration) {
          if (displayMode != 4) return;
          if (forceMessageRestart) return;
          yield();
        }
        advanceDisplayMode();
        return;
      }

      // --- SCROLL: more than 5 digits, same technique as Custom Message ---
      P.setTextAlignment(PA_LEFT);
      P.setCharSpacing(0);  // explicit 2px gap below, not auto-spacing
      String iconStr = String(icon) + " ";
      // 1. Manually add a 1px space between each digit of the number
      String spacedCountStr = "";
      for (unsigned int i = 0; i < countStr.length(); i++) {
        spacedCountStr += countStr[i];
        if (i < countStr.length() - 1) {
          spacedCountStr += " ";  // Inject a 1px font space between digits
        }
      }
      String scrollText = String(iconStr) + " " + spacedCountStr;
      textEffect_t actualScrollDirection = getEffectiveScrollDirection(PA_SCROLL_LEFT, flipDisplay);
      P.displayScroll(scrollText.c_str(), PA_LEFT, actualScrollDirection, GENERAL_SCROLL_SPEED);

      while (!P.displayAnimate()) {
        if (displayMode != 4) return;
        if (forceMessageRestart) return;
        yield();
      }

      advanceDisplayMode();
      return;
    }

    // --- RSS display ---
    if (snsType == SNS_RSS) {
      P.setCharSpacing(1);
      char charIcon = 194;
      String rssIcon = String(charIcon) + " ";

      if (rssTitle.length() == 0) {
        // Not yet fetched
        P.setTextAlignment(PA_CENTER);
        P.setCharSpacing(0);
        String waitText = String(rssIcon) + " - -";
        P.print(waitText.c_str());
        unsigned long rssStart = millis();
        while (millis() - rssStart < weatherDuration) {
          if (displayMode != 4) return;
          if (forceMessageRestart) return;
          yield();
        }
        advanceDisplayMode();
        return;
      }

      // Title is ready — remap digits to small font glyphs, then scroll
      String rssDisplay = rssTitle;
      for (int i = 0; i < rssDisplay.length(); i++) {
        if (isDigit(rssDisplay[i])) {
          int num = rssDisplay[i] - '0';
          rssDisplay[i] = 145 + ((num + 9) % 10);
        }
      }

      textEffect_t actualScrollDirection = getEffectiveScrollDirection(PA_SCROLL_LEFT, flipDisplay);

      // Padding logic (same as weather scroll)
      bool addPadding = false;
      bool humidityVisible = showHumidity && weatherAvailable && strlen(openWeatherApiKey) == 32 && strlen(openWeatherCity) > 0 && strlen(openWeatherCountry) > 0;
      if (prevDisplayMode == 0 && (showDayOfWeek || colonBlinkEnabled)) {
        addPadding = true;
      } else if (prevDisplayMode == 1 && humidityVisible) {
        addPadding = true;
      }
      String scrollText = String(rssIcon) + rssDisplay;
      if (addPadding) {
        scrollText = "   " + scrollText;  // 3 spaces
      }
      P.setTextAlignment(PA_LEFT);
      P.setCharSpacing(1);
      P.displayScroll(scrollText.c_str(), PA_LEFT, actualScrollDirection, RSS_SCROLL_SPEED);
      while (!P.displayAnimate()) {
        if (displayMode != 4) return;
        if (forceMessageRestart) return;
        yield();
      }
      advanceDisplayMode();
      return;
    }

    P.setCharSpacing(1);

    if (currentGlucose != -1) {
      time_t nowUTC = time(nullptr);

      bool isOutdated = false;
      int ageMinutes = 0;

      if (lastGlucoseTime > 0) {
        double diffSec = difftime(nowUTC, lastGlucoseTime);
        ageMinutes = (int)(diffSec / 60.0);
        isOutdated = (ageMinutes > NIGHTSCOUT_IDLE_THRESHOLD_MIN);
        Serial.printf("[NIGHTSCOUT] Data age: %d minutes old (threshold: %d)\n", ageMinutes, NIGHTSCOUT_IDLE_THRESHOLD_MIN);
      }

