obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
      char arrow;
      if (currentDirection == "Flat") arrow = 139;
      else if (currentDirection == "SingleUp") arrow = 134;
      else if (currentDirection == "DoubleUp") arrow = 135;
      else if (currentDirection == "SingleDown") arrow = 136;
      else if (currentDirection == "DoubleDown") arrow = 137;
      else if (currentDirection == "FortyFiveUp") arrow = 138;
      else if (currentDirection == "FortyFiveDown") arrow = 140;
      else arrow = '?';

      // --- Build glucose display string ---
      String glucoseDisplay;
      if (nightscoutMmol) {
        char tmp[8];
        dtostrf(currentGlucose / 18.018f, 4, 1, tmp);
        glucoseDisplay = String(tmp);
        glucoseDisplay.trim();
      } else {
        glucoseDisplay = String(currentGlucose);
      }

      String displayText = "";
      if (isOutdated) {
        // First pass: convert digits to dimmed variants, dot to char(206)
        String styledStr = "";
        for (int i = 0; i < glucoseDisplay.length(); i++) {
          char c = glucoseDisplay[i];
          if (c == '.') {
            styledStr += char(206);  // mid-line dot for decimal point
          } else if (isDigit(c)) {
            int num = c - '0';
            styledStr += char(195 + ((num + 9) % 10));  // dimmed digit
          } else {
            styledStr += c;
          }
        }

        // Second pass: wrap and separate every character with char(205)
        // Result: (205)(char)(205)(char)(205)...(char)(205)
        String separatedStr = "";
        separatedStr += char(205);  // leading cap
        for (int i = 0; i < styledStr.length(); i++) {
          separatedStr += styledStr[i];
          separatedStr += char(205);  // after every character including last
        }

        displayText += separatedStr;
        displayText += " ";
        displayText += arrow;
        P.setCharSpacing(0);
      } else {
        displayText += glucoseDisplay + String(arrow);
        P.setCharSpacing(1);
      }

      P.setTextAlignment(PA_CENTER);
      P.print(displayText.c_str());
      unsigned long nightscoutStart = millis();
      while (millis() - nightscoutStart < weatherDuration) {
        if (displayMode != 4) return;
        if (forceMessageRestart) return;
        yield();
      }
      advanceDisplayMode();
      return;
    } else {
      P.setTextAlignment(PA_CENTER);
      P.setCharSpacing(0);
      P.write(15);
      unsigned long errorStart = millis();
      while (millis() - errorStart < 2000) {
        if (displayMode != 4) return;
        if (forceMessageRestart) return;
        yield();
      }
      advanceDisplayMode();
      return;
    }
  }


  // DATE Display Mode
  else if (displayMode == 5 && showDate) {
    if (forceMessageRestart) return;

    if (timeinfo.tm_year < 120 || timeinfo.tm_mday <= 0 || timeinfo.tm_mon < 0 || timeinfo.tm_mon > 11) {
      advanceDisplayMode();
      return;
    }

    // 1. Month uses the custom font logic (lowercase + \016)
    const char *const *months = getMonthsOfYear(language);
    String monthAbbr = getFormattedDateText(months[timeinfo.tm_mon]);

    // 2. Day digits ALWAYS use standard spaces (" "), never the custom \016
    String dayString = String(timeinfo.tm_mday);
    String spacedDay = "";
    for (size_t i = 0; i < dayString.length(); i++) {
      spacedDay += dayString[i];
      if (i < dayString.length() - 1) {
        spacedDay += " ";  // Hardcoded standard space
      }
    }

    String dateString;
    String langStr = String(language);

    if (langStr == "ja") {
      // Japanese: "1 ²  2 4 ±"
      dateString = monthAbbr + spacedDay + " ±";
    } else {
      auto isDayFirst = [](const String &lang) {
        const char *dayFirstLangs[] = { "af", "cs", "da", "de", "eo", "es", "et", "fi", "fr", "ga", "hr", "hu", "it", "lt", "lv", "nl", "no", "pl", "pt", "ro", "ru", "sk", "sl", "sr", "sv", "sw", "tr" };
        for (auto lf : dayFirstLangs) {
          if (lang.equalsIgnoreCase(lf)) return true;
        }
        return false;
      };

      // monthAbbr already has trailing "  " from your function
      if (isDayFirst(langStr)) {
        // Result: "2 4  f\016e\016b  "
        dateString = spacedDay + "  " + monthAbbr;
      } else {
        // Result: "f\016e\016b  2 4"
        dateString = monthAbbr + spacedDay;
      }
    }

    P.setTextAlignment(PA_CENTER);
    P.setCharSpacing(0);
    P.print(dateString.c_str());

    if (millis() - lastSwitch > weatherDuration) {
      advanceDisplayMode();
    }
  }


  // --- Custom Message Display Mode (displayMode == 6) ---
  if (displayMode == 6) {
    int totalPixelWidth = 0;

    if (forceMessageRestart) {
      P.displayReset();
      P.displayClear();

      // RESET TIMERS/COUNTERS so new messages start fresh
      messageStartTime = millis();
      currentScrollCount = 0;
      currentDisplayCycleCount = 0;

      forceMessageRestart = false;
    }

    if (strlen(customMessage) == 0) {
      advanceDisplayMode();
      yield();
      return;
    }

    String msg = String(customMessage);

    // --- Strip brackets around numeric tokens ONLY ---
    if (messageBigNumbers) {
      while (true) {
        int start = msg.indexOf('[');
        int end = msg.indexOf(']', start);

        if (start == -1 || end == -1) break;

        String inside = msg.substring(start + 1, end);

        bool isNumber = true;
        for (char c : inside) {
          if (!isdigit(c)) {
            isNumber = false;
            break;
          }
        }

        if (isNumber) {
          msg.remove(end, 1);
          msg.remove(start, 1);
        } else {
          break;  // leave icon tokens like [MOON]
        }
      }
    }

    replaceIconTokens(msg, totalPixelWidth);

    if (!messageBigNumbers) {
      for (int i = 0; i < msg.length(); i++) {
        if (isDigit(msg[i])) {
          int num = msg[i] - '0';
          msg[i] = 145 + ((num + 9) % 10);
        }
      }
    }

    // --- TIMEOUT & LIMIT CHECKS ---
    bool timedOut = (messageDisplaySeconds > 0 && (millis() - messageStartTime) >= (messageDisplaySeconds * 1000UL));
    bool scrollsComplete = (messageScrollTimes > 0 && currentScrollCount >= messageScrollTimes);
    bool cyclesComplete = (messageScrollTimes > 0 && currentDisplayCycleCount >= messageScrollTimes);

