obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
    if (timedOut || scrollsComplete || cyclesComplete) {
      allowInterrupt = true;
      if (strlen(lastPersistentMessage) > 0) {
        strncpy(customMessage, lastPersistentMessage, sizeof(customMessage));
        messageScrollSpeed = GENERAL_SCROLL_SPEED;
      } else {
        customMessage[0] = '\0';
      }
      currentScrollCount = 0;
      messageStartTime = 0;
      currentDisplayCycleCount = 0;
      messageDisplaySeconds = 0;
      messageScrollTimes = 0;
      prevDisplayMode = 6;  // Set for Clock scroll-in
      advanceDisplayMode();
      yield();
      return;
    }

    // --- BRANCH A: STATIC (0-32 pixels) ---
    if (totalPixelWidth <= 32) {
      unsigned long durationMs = (messageDisplaySeconds > 0) ? (messageDisplaySeconds * 1000UL) : weatherDuration;

      // 1. Initial Centered Display
      P.setTextAlignment(PA_CENTER);
      P.setCharSpacing(1);
      P.print(msg.c_str());

      unsigned long displayUntil = millis() + durationMs;
      while (millis() < displayUntil) {
        if (displayMode != 6) return;
        if (forceMessageRestart) return;
        yield();
      }

      // 2. THE MANUAL SHIFT (Create 4-5px of pure black)
      // We only want to "push" the text off-screen if this is the VERY LAST cycle
      bool isLastCycle = (messageScrollTimes > 0 && (currentDisplayCycleCount + 1 >= messageScrollTimes))
                         || (messageScrollTimes == 0);

      if (totalPixelWidth >= 27 && isLastCycle) {
        // Shift the internal pixel buffer 5 times
        for (uint8_t i = 0; i < 5; i++) {
          if (displayMode != 6) return;
          if (flipDisplay) {
            P.getGraphicObject()->transform(MD_MAX72XX::TSR);  // shift right
          } else {
            P.getGraphicObject()->transform(MD_MAX72XX::TSL);  // shift left
          }
          delay(messageScrollSpeed);
        }
      }

      // 3. Handover to Clock
      if (messageScrollTimes > 0) {
        currentDisplayCycleCount++;
      } else {
        advanceDisplayMode();
        prevDisplayMode = 6;
        clockScrollDone = false;
      }
      yield();
      return;
    }

    // --- BRANCH B: SCROLLING ---
    bool addPadding = false;
    bool humidityVisible = showHumidity && weatherAvailable && strlen(openWeatherApiKey) == 32 && strlen(openWeatherCity) > 0 && strlen(openWeatherCountry) > 0;
    if (prevDisplayMode == 0 && (showDayOfWeek || colonBlinkEnabled)) addPadding = true;
    else if (prevDisplayMode == 1 && humidityVisible) addPadding = true;

    if (addPadding) msg = "    " + msg;

    P.setTextAlignment(PA_LEFT);
    P.setCharSpacing(1);
    textEffect_t actualScrollDirection = getEffectiveScrollDirection(PA_SCROLL_LEFT, flipDisplay);

    P.displayScroll(msg.c_str(), PA_LEFT, actualScrollDirection, messageScrollSpeed);

    while (!P.displayAnimate()) {
      if (displayMode != 6) return;
      if (forceMessageRestart) return;  // Exit immediately to top level
      yield();
    }

    currentScrollCount++;

    if (messageDisplaySeconds == 0 && messageScrollTimes == 0) {
      prevDisplayMode = 6;
      advanceDisplayMode();
    }
    yield();
    return;
  }

  if (displayMode == 7) {
    showTimerMode7();
  }

  unsigned long currentMillis = millis();
  unsigned long currentTotal = getTotalRuntimeSeconds();

  // --- Log and save uptime every 10 minutes ---
  const unsigned long uptimeLogInterval = 600000UL;  // 10 minutes in ms

  // ---- CONFIG AUTO SAVE ----
  if (configDirty && millis() - lastBrightnessChange > saveDelay) {
    saveConfigRuntime();
    configDirty = false;
    Serial.println("[CONFIG] Auto-saved");
  }

  if (currentMillis - lastUptimeLog >= uptimeLogInterval) {
    lastUptimeLog = currentMillis;
    Serial.printf("[UPTIME] Runtime: %s (total %.2f hours)\n",
                  formatUptime(currentTotal).c_str(), currentTotal / 3600.0);
    saveUptime();  // Save accumulated uptime every 10 minutes
  }
  yield();
}

char getPomodoroWorkIcon() {
  switch (pomodoroSession) {
    case 1: return '\xBC';  // quarter
    case 2: return '\xBD';  // half
    case 3: return '\xBE';  // three quarters
    case 4: return '\x83';  // full
    default: return '\xBC';
  }
}

void showTimerMode7() {
  unsigned long now = millis();
  P.setCharSpacing(1);

  // --- 1. INTERRUPT LOGIC ---
  if (allowInterrupt == false) {
    unsigned long waitTime = (unsigned long)clockDuration;
    if (now - lastSwitch >= waitTime) {
      Serial.println(F("[TIMER] clockDuration reached. Switching to Mode 6 (Infinite)"));
      displayMode = 6;
      lastSwitch = now;
      return;
    }
  }

  // --- 2. STOPWATCH / POMODORO BREAK ---
  if (isStopwatch) {
    unsigned long elapsed = timerPaused ? timerRemainingAtPause : (millis() - timerEndTime);

    if (isPomodoroActive) {
      unsigned long currentBreakMs = (pomodoroSession == 4) ? pomodoroLongBreakMs : pomodoroBreakMs;
      if (!timerPaused && elapsed >= currentBreakMs) {
        pomodoroSession++;
        if (pomodoroSession > 4) pomodoroSession = 1;
        pomodoroInBreak = false;
        isStopwatch = false;
        timerOriginalDuration = pomodoroWorkMs;
        timerEndTime = millis() + pomodoroWorkMs;
        timerFinished = false;
        timerPaused = false;
        Serial.printf("[POMODORO] Break over. Starting session %d.\n", pomodoroSession);
        return;
      }
      unsigned long remaining = (currentBreakMs > elapsed) ? (currentBreakMs - elapsed) : 0;
      unsigned long totalSec = remaining / 1000;
      int m = totalSec / 60;
      int s = totalSec % 60;
      char buf[10];
      sprintf(buf, "%c %02d:%02d", '\xBF', m, s);
      P.setTextAlignment(PA_CENTER);
      P.print(buf);
      return;
    }

    // Normal stopwatch with centiseconds
    unsigned long totalSec = elapsed / 1000;
    int cs = (elapsed % 1000) / 10;
    int m = totalSec / 60;
    int s = totalSec % 60;
    char buf[12];
    if (m > 59) {
      int h = m / 60;
      m = m % 60;
      sprintf(buf, "%02d:%02d:%02d", h, m, s);
    } else {
      sprintf(buf, "%02d:%02d.%02d", m, s, cs);
    }
    P.setTextAlignment(PA_CENTER);
    P.print(buf);
    return;
  }

