obalado/ESPTimeCast/ESPTimeCast_ESP32/main.cpp
  // --- 3. COUNTDOWN TIMER ---
  if (!timerFinished) {
    long remaining = 0;
    if (timerPaused) {
      remaining = (long)(timerRemainingAtPause / 1000);
    } else {
      if (now >= timerEndTime) {
        timerFinished = true;
        timerFinishStartTime = now;
      } else {
        remaining = (long)((timerEndTime - now) / 1000);
        if (remaining < 0) remaining = 0;

        int h = remaining / 3600;
        int m = (remaining % 3600) / 60;
        int s = remaining % 60;

        char buf[12];
        if (isPomodoroActive) {
          char icon = getPomodoroWorkIcon();
          if (h > 0) sprintf(buf, "%c %02d:%02d:%02d", icon, h, m, s);
          else sprintf(buf, "%c %02d:%02d", icon, m, s);
        } else {
          if (h > 0) sprintf(buf, "%02d:%02d:%02d", h, m, s);
          else sprintf(buf, "%02d:%02d", m, s);
        }

        P.setTextAlignment(PA_CENTER);
        P.print(buf);
        return;
      }
    }

    if (timerPaused) {
      int h = remaining / 3600;
      int m = (remaining % 3600) / 60;
      int s = remaining % 60;
      char buf[12];
      if (isPomodoroActive) {
        char icon = getPomodoroWorkIcon();
        if (h > 0) sprintf(buf, "%c %02d:%02d:%02d", icon, h, m, s);
        else sprintf(buf, "%c %02d:%02d", icon, m, s);
      } else {
        if (h > 0) sprintf(buf, "%02d:%02d:%02d", h, m, s);
        else sprintf(buf, "%02d:%02d", m, s);
      }
      P.setTextAlignment(PA_CENTER);
      P.print(buf);
      return;
    }
  }

  // --- 4. FINISHED STATE ---
  if (timerFinished) {
    if (isPomodoroActive) {
      pomodoroInBreak = true;
      isStopwatch = true;
      // Session 4 gets the long break
      timerEndTime = millis();
      timerActive = true;
      timerPaused = false;
      timerFinished = false;
      Serial.printf("[POMODORO] Session %d done. Starting %s break.\n",
                    pomodoroSession, pomodoroSession == 4 ? "long" : "short");
      return;
    }

    // Normal timer: alarm animation for 5 seconds
    if (now - timerFinishStartTime > 5000) {
      timerActive = false;
      timerFinished = false;
      displayMode = 0;
      clockScrollDone = false;
      lastSwitch = now;
      return;
    }
    if ((now / 500) % 2 == 0) P.print("\x08");
    else P.print("\x09");
  }
}